{
    "Dental Pulp": {
        "img": "./src/assets/Dental_Pulp/Dental_Pulp.jpg",
        "card_content": {
            "title": "Dental Pulp",
            "content": "Pulp is a connective tissue consisting of nerves, blood vessels, ground substance, interstitial fluid, odontoblasts, fibroblasts, and other cellular components. The dental pulp consists of vascular connective tissue contained within rigid dentinal walls. Although similar to other connective tissues in the human body, it is specialized, owing to its functions and environment.<br><br><strong>Citation</strong> <a  target='_blank' href='https://www.scribd.com/document/516867092/Seltzer-and-Benders-Dental-Pulp'>https://www.scribd.com/document/516867092/Seltzer-and-Benders-Dental-Pulp</a>"
        },
        "categories": {
            "Normal Pulp": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Categories/Banner/Normal_Pulp.jpg",
                    "title": "Dental Pulp: Normal Pulp",
                    "content": "Dental pulp is a soft tissue which is present inside the tooth and contains blood vessels, nerves, and lymphatics. It is present in both coronal and radicular portion of the tooth. <br><br> The dental pulp is composed of cells which fall into four major categories: synthetic cells, progenitor cells, defense cells, and other cells. <br><br> The pulp has four histological zones: odontoblastic zone, cell-free zone of Weil, cell-rich zone, and central zone. The odontogenic zone consists of cell bodies of columnar odontoblastic cells and their cytoplasmic processes.The cell-free zone of Weil is also called “sub-odontoblastic layer” or “Hoehl's layer.” The cell-rich zone lies next to central zone and blends with it. The pulp central zone comprises prominent blood vessels and nerves and is present below the cell rich zone. <br><br> Pulp fibrosis is an age-related condition in which the pulp gets gradually replaced by fibrous bundles of collagen with aging.<br><br><strong>Citations</strong>M Goldberg, editor. The Dental Pulp. Berlin, Heidelberg: Springer Berlin Heidelberg; 2014. <br> <a target='_blank' href='https://www.academia.edu/16279447/Cohens_Pathways_of_the_Pulp_10th_ed_dentistry_K_Hargreaves_et_al_Mosby_2011_BBS'> https://www.academia.edu/16279447/Cohens_Pathways_of_the_Pulp_10th_ed_dentistry_K_Hargreaves_et_al_Mosby_2011_BBS </a> <br> <a target='_blank' href='https://link.springer.com/book/10.1007/978-3-642-55160-4'> https://link.springer.com/book/10.1007/978-3-642-55160-4 </a> "
                },
                "sub_categories": [
                    "Zones of Pulp",
                    "Effects of Aging on Pulp",
                    "Mineralizations",
                    "Functions of Pulp"
                ]
            },
            "Pulp Space Anatomy of Individual Tooth": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Categories/Banner/Anatomy_of_Individual_Tooth.png",
                    "title": "Dental Pulp: Pulp Space Anatomy of Individual Tooth",
                    "content": "The external morphologic features of the crowns of teeth vary according to the shape and size of the head. The length of the crown differs with the size and gender of the person and is generally shorter in females than in males. As the external morphology of the tooth varies from person to person, so does the internal morphology of the crown and root. Changes in pulp cavity anatomy result from age, disease, and trauma. Although morphologic variations occur, clinical experience indicates that these changes usually follow a general pattern, and thus the study of pulp cavity morphology is an important undertaking. <br><br> <strong>Citations</strong>1. Grossman's Endodontic Practice - 14th edition; Anatomy of Pulp Cavity and Its Access Opening;  Publisher: Wolters Kluwer Health; Editor: Suresh Chandra and V Gopikrishna ISBN: 9788184739176 <br> <a target='_blank' href='https://www.researchgate.net/publication/265088248_Grossman's_Endodontic_Practice_-_13th_edition'>https://www.researchgate.net/publication/265088248_Grossman's_Endodontic_Practice_-_13th_edition </a> <br> 2. Vertucci, F. J. (1984). Root canal anatomy of the human permanent teeth. Oral Surgery, Oral Medicine, Oral Pathology, 58(5), 589-599. <br> <a target='_blank' href='http://dx.doi.org/10.1016/0030-4220(84)90085-9'>http://dx.doi.org/10.1016/0030-4220(84)90085-9 </a>"
                },
                "sub_categories": [
                    "Maxillary Central Incisor",
                    "Maxillary Lateral Incisor",
                    "Maxillary Canine",
                    "Maxillary First Premolar",
                    "Maxillary Second Premolar",
                    "Maxillary First Molar",
                    "Maxillary Second Molar",
                    "Maxillary Third Molar",
                    "Mandibular Central Incisor",
                    "Mandibular Lateral Incisor",
                    "Mandibular Canine",
                    "Mandibular First Premolar",
                    "Mandibular Second Premolar",
                    "Mandibular First Molar",
                    "Mandibular Second Molar",
                    "Mandibular Third Molar"
                ]
            },
            "Diseases of the Dental Pulp": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Categories/Banner/Diseases_of_Dental_Pulp.jpg",
                    "title": "Dental Pulp: Diseases of the Dental Pulp",
                    "content": "The pulp is the formative organ of the tooth. It builds primary dentin during the development of the tooth, secondary dentin after tooth eruption, and reparative dentin in response to stimulation as long as the odontoblasts remain intact.<br><br>The pulp has been described as a highly resistant organ and as an organ with little resistance or healing ability. Its resistance depends on cellular activity, nutritional supply, age, and other metabolic and physiologic parameters.<br><br>Accurate pulpal diagnosis is the key to all endodontic treatments. Unfortunately, there has been a poor correlation between the clinical symptoms and the histopathology of the pulp. Previous attempts that have been made to diagnose the condition of the pulp based on clinical signs (or symptoms), electric pulp test, and/or thermal tests and radiography have not always been successful. The endodontist is expected to understand the various causative factors of pulpal diseases, collect information about the presentation and history of symptoms, and conduct many practical tests before formulating the final diagnosis.<br><br><strong>Clinical Note</strong>The value of the pulp as an integral part of the tooth, both anatomic and functional, should be recognized and every effort made to conserve it. <br><br> <strong>Citations</strong>1. Singh, G., Paul R, S., Arora, A., Kumar, S., Jindal, L., & Raina, S. (2020). Disease of Pulp and Periradicular Tissue: An Overview. Journal of Current Medical Research and Opinion, 3(10). <br> <a target='_blank' href='https://www.researchgate.net/publication/346244739_Disease_of_Pulp_and_Periradicular_Tissue_An_Overview'>https://www.researchgate.net/publication/346244739_Disease_of_Pulp_and_Periradicular_Tissue_An_Overview</a> <br> 2. Abbott, P., & Yu, C. (2007). A clinical classification of the status of the pulp and the root canal system. Australian Dental Journal, 52, S17-S31. <br> <a target='_blank' href='https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1834-7819.2007.tb00522.x'>https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1834-7819.2007.tb00522.x</a>"
                },
                "sub_categories": [
                    "Classification",
                    "Causes"
                ]
            },
            "Pulp Space Anatomy": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Categories/Banner/Pulp_Space_Anatomy.png",
                    "title": "Dental Pulp: Pulp Space Anatomy",
                    "content": "The external morphologic features of the crowns of teeth vary according to the shape and size of the head. The length of the crown differs with the size and gender of the person and is generally shorter in females than in males. As the external morphology of the tooth varies from person to person, so does the internal morphology of the crown and root. Changes in pulp cavity anatomy result from age, disease, and trauma. Although morphologic variations occur, clinical experience indicates that these changes usually follow a general pattern, and thus the study of pulp cavity morphology is an important undertaking.<br><br><strong>Citation</strong>Krasner P, Rankow HJ. Anatomy of the pulp-chamber floor. J Endod. 2004;30(1):5-16."
                },
                "sub_categories": [
                    "Pulp Space",
                    "Pulp Chamber",
                    "Root Canals",
                    "Vertucci's Classification",
                    "Weine's Classification",
                    "Classification based on Canal Cross-section",
                    "Isthmus",
                    "Apical Foramen",
                    "Lateral Canals and Accessory Foramina",
                    "Influence of aging on pulp space",
                    "Anomalies of Pulp Cavities"
                ]
            }
        },
        "sub_categories": {
            "Effects of Aging on Pulp": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Effects_of_Aging_on_Pulp.png",
                    "title": "Normal Pulp: Effects of Aging on Pulp",
                    "content": "Age causes important changes in the pulp.<br><br>• The continuous deposition of secondary dentin throughout the life of the pulp and the deposition of reparative dentin in response to stimuli reduce the size of the pulp chambers and root canals and thereby decrease the pulp volume.<br><br> This diminution of the pulp is called atrophy.<br><br>• A concomitant decrease in the diameter of the dentinal tubules by the continuous deposition of peritubular dentin also occurs.<br><br>• Some of these tubules close completely and form sclerotic dentin. The decrease in pulp volume reduces cellular, vascular, and neural content of the pulp. The odontoblasts undergo atrophy and may disappear completely under areas of sclerotic dentin.<br><br>• A reduction in the fluid content of the dentinal tubules is also seen. These changes make the dentin less permeable and more resistant to external stimuli.<br><br>• The fibroblasts are reduced in size and numbers, but the collagen fibers are increased in number and in size, probably because of the decrease in the collagen solubility and turnover with advancing age. This change is referred to as fibrosis. Fibrosis is more evident in the radicular portion of the pulp than elsewhere.<br><br>• The blood vessels decrease in number, and arteries undergo arteriosclerotic changes. Calcific material is deposited in the tunica adventitia and tunica media. These changes reduce the blood supply to the pulp.<br><br>• The number of nerves is also reduced.<br><br>• The ground substance undergoes metabolic changes that predispose it to mineralization. Changes in the blood vessels, nerves, and ground substance predispose the pulp to dystrophic calcifications.<br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Effects_of_Aging_on_Pulp_1.jpg' alt='Image-1'> <span> Age changes in the pulp. (A) Translucent dentin formation (TD and white arrows), starting in the apical area and proceeding coronally, causes a gradual closure of the dentinal tubules, rendering them impermeable to bacterial colonization. Also continued cementum formation (C) causes a change in the anatomical landmarks. (B) Dystrophic or diffuse calcifications in an aged pulp. (C) “Scar tissue” in the pulp, presented by tertiary dentin under a restauration with marginal leakage. Extensive cavity preparations, resulting in large amounts of tertiary dentin, may compromise the pulpal circulation. (D) Denticles (DT), both embedded and free, are relative common in the pulp tissue. They may increase in size during aging. White arrows points at nerve fibers in the root.</span> <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Effects_of_Aging_on_Pulp.jpg' alt='Image-1'> <span> Flattening of the pulp chamber due to dentin production in the pulp roof and floor, combined with narrowing of the root canals. </span> <strong>Citations</strong>1. Bernick, S., & Nedelman, C. (1975). Effect of aging on the human pulp. Journal of Endodontics, 1(3), 88-94. <br> <a target='_blank' href='https://doi.org/10.1016/s0099-2399(75)80024-0'>https://doi.org/10.1016/s0099-2399(75)80024-0</a> <br> 2. Maeda H. Aging and Senescence of Dental Pulp and Hard Tissues of the Tooth. Front Cell Dev Biol. 2020 Nov 30;8:605996. <br> <a target='_blank' href='https://www.readcube.com/articles/10.3389/fcell.2020.605996'>https://www.readcube.com/articles/10.3389/fcell.2020.605996 </a>"
                }
            },
            "Mineralizations": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Mineralizations.png",
                    "title": "Normal Pulp: Mineralizations",
                    "content": "The other histologic structures found in the dental pulp are mineralizations. Although their presence has been related to age and disease, they are also found in young normal dental pulps. They are present as:<br><br>• Nodules called denticles or pulp stones: The denticles are either true or false denticles, according to their histologic structure. <br><br>- True denticles are uncommon, are usually found near the apex, and are composed of dentin or dentinal-type calcifications with tubules, surrounded by odontoblast- like cells. <br><br>- False denticles are of two types histologically: <br>• Round or ovoid with concentric calcified layers and smooth surfaces.<br>• Amorphous without lamination and rough surfaces. <br><br> <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mineralizations_1.png' alt='Image-1'> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mineralizations_2.png' alt='Image-1'> <br>  <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mineralizations_3.png' alt='Image-1'> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mineralizations_4.png' alt='Image-1'> <br> Pulp stones form under a number of different conditions. True pulp stones with the dentin structure probably form from fragmented portions of Hertwig's epithelium on the pulpal side. Odontoblasts may also be differentiated from the immature cells in the dental pulp and initiate histogenesis of denticles. Dentin fragments introduced into the pulp following pulpal exposures may act as foci for pulp stone formation.<br><br> Pulp stones may also be classified as free, attached, or embedded. <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mineralizations.jpg' alt='Image-1'> <br> • Diffuse calcifications: They usually follow the trajectory of the blood vessels, the nerves, and the collagen fiber bundles. They are most often found in the walls of blood vessels. Diffuse calcifications seem to be related to aging because their incidence increases with age. <br><br> <strong>Clinical Note</strong> • The denticles predominate in the pulp chamber, whereas diffuse calcifications are predominantly found in the root canals. <br><br> • Radiographs may show denticles in the coronal chamber. <br><br> This finding should alert the clinician to the possible need for removal of the denticles to obtain access into the orifices of the root canals. <br><br> • Calcifications in the root canals usually are not seen radiographically, but they are detectable during exploration of the root canal. This type of calcification may prevent the clinician from reaching the apical foramen and may therefore prevent complete instrumentation of the root canal."
                }
            },
            "Functions of Pulp": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Functions_of_Pulp.png",
                    "title": "Normal Pulp: Functions of Pulp",
                    "content": "• Formative: Elaboration of dentin to form the tooth <br><br>• Protective: Protection against and repairing of the effects of noxious stimuli. <br><br>• Nutritive: Preserving the vitality of all the cellular elements. <br><br>• Sensory: Perception of stimuli.<br><br> The elaboration of dentin creates a special environment for the pulp. The pulp space becomes limited by dentin formation in permanent adult human teeth. This volume is continuously reduced by the deposition of secondary dentin throughout the life of the pulp as well as by the deposition of reparative dentin in response to noxious stimuli. The encasement of the pulp in dentin creates an environment that allows only small amounts of intercellular accommodation of exudate during inflammatory reactions.<br><br>The anatomic limitation of encasement of dentin on the pulp makes the pulp an organ of terminal circulation, with limited portals of entry and exit: the apical and accessory foramina. This feature limits the vascular supply and drainage of the pulp and thereby limits its collateral circulation. <br><br> <strong> Clinical Note </strong> The inability of the pulp to swell creates abnormally high pressure in an area of inflammation, with interruption of blood flow due to the collapse of the pulpal veins, possibly resulting in anoxia and localized necrosis. <br><br> <strong>Citation</strong> Yu C, Abbott PV. An overview of the dental pulp: its functions and responses to injury. Aust Dent J. 2007;52(1 Suppl):S4-S16 <br> <a target='_blank' href='https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1834-7819.2007.tb00525.x '>https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1834-7819.2007.tb00525.x</a>"
                }
            },
            "Maxillary Central Incisor": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Maxillary_Central_Incisor.png",
                    "title": "Pulp Space Anatomy of Individual Tooth: Maxillary Central Incisor",
                    "content": "<strong>Average Tooth Length:</strong> The average length of this tooth is 23.5 mm.<br><br><strong>Pulp Chamber:</strong> The pulp chamber of the maxillary central  incisor is located in the center of the crown equidistant from the dentinal walls. It is broad mesiodistally, with its broadest part incisally aligned. The pulp chamber usually follows the contours of the crown and has three pulp horns that correspond to the developmental mamelons in a young tooth. The chamber is ovoid mesiodistally. The division between the root canal and the pulp chamber is indistinct.<br><br> <strong>Root and Root Canal:</strong> The maxillary central incisor has one root with one root canal. The root canal is broad labiopalatally, large, and simple in outline, conical in shape, and centrally located. A definite apical constriction is present in the mature root canal. In cross-section, the canal is ovoid mesiodistally in the cervical third, ovoid to almost round in the middle third, and round in the apical third.<br><br><strong>Clinical Significance:</strong>• Although the majority of the roots are straight (75%), some may curve labially or palatally (17%). The palatal and labial curvatures may not be seen in a routine radiograph unless taken at different horizontal angulations.<br><br>• Lateral canals may be present (24%), usually in the apical third.<br><br>• The labial surface of the root of the maxillary central incisor lies under the labial cortical plate of the maxilla and may fuse with it. Because of the proximity of the labial root surface to the cortical plate, fenestrations and dehiscence may be present, and abscesses may perforate the labial cortical plate.<br><br>• The relationship between the apex of the maxillary central incisor and the osseous plate in the floor of the nasal cavity depends on the height of the face and the length of the root. Usually, the nasal fossa and the root apex are separated sufficiently so that curettage of granulomatous tissue within the surrounding cancellous bone does not result in perforation of the floor of the nasal fossa. In some patients, the apex of the root is close to the nasal floor and hence an abscess may drain into the nasal fossa, or a cyst may bulge into the inferior nasal meatus.<br><br>• Labial perforations are the most common iatrogenic errors committed during access preparation.<br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_Central_Incisor.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_Central_Incisor_2.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_Central_Incisor_3.png' alt='Image-1'> <br>μCT scans of maxillary central incisors. A, Common anatomic presentation. B, Central incisor with a lateral canal, which is common. C, Rare multiple-canal variation. All teeth are shown from both a buccal (vestibular) and a proximal perspective, along with the cross-sectional anatomy at the coronal, middle, and apical levels. <br><br> <strong>Citations</strong>Grawish, M. E., Grawish, L. M., & Grawish, H. M. (2018). Permanent Maxillary and Mandibular Incisors. Dental Anatomy. <br> <a target='_blank' href='https://www.researchgate.net/publication/326750563_Permanent_Maxillary_and_Mandibular_Incisors'>https://www.researchgate.net/publication/326750563_Permanent_Maxillary_and_Mandibular_Incisors</a> <br> <a target='_blank' href='https://www.intechopen.com/chapters/56461'>https://www.intechopen.com/chapters/56461</a>"
                }
            },
            "Maxillary Lateral Incisor": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Maxillary_Lateral_Incisor.png",
                    "title": "Pulp Space Anatomy of Individual Tooth: Maxillary Lateral Incisor",
                    "content": "<strong>Average Tooth Length:</strong> The average length of this tooth is 22 mm.<br><br><strong>Pulp Chamber:</strong> The shape of the pulp chamber of the maxillary lateral incisor is similar to that of the maxillary central  incisor but smaller. It has only two pulp horns, corresponding to the developmental mamelons. It is broad mesiodistally, with its broadest part incisally aligned. The division between the root canal and the pulp chamber is indistinct.<br><br> <strong>Root and Root Canal:</strong>The configuration of the root canal of the maxillary lateral incisor is also conical, but it has a finer diameter than the maxillary central incisor, and occasionally may have a fine constriction in its course toward the apex. In cross-section, the canal is ovoid labiopalatally in the cervical third because of the flatness of the root, ovoid in the middle third, and round in the apical third.<br><br><strong>Clinical Note</strong>• Lateral canals occur more frequently in these teeth (26%) than in maxillary central incisors.<br><br>• The majority of roots have a distal curve (53%), whereas others are straight (30%).<br><br>• As with the central incisor, the labial surface of the root of the maxillary lateral incisor lies under the labial cortical plate of the maxilla; therefore, fenestrations and dehiscence may be present. As this root curves distally, it may be in the center of the cancellous bone pointing toward the palate, and abscesses arising in this area may drain palatally as well as labially.<br><br>•The access opening should be more conservative than that of the central incisor. Labial perforation is the most common iatrogenic access opening error.<br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_Lateral_Incisor.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_Lateral_Incisor_2.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_Lateral_Incisor_3.png' alt='Image-1'> <br> μCT scans of maxillary lateral incisors. A, Common anatomic presentation. B, Lateral incisor with a large lateral canal, which is common. C, Lateral incisor with an apical delta. All teeth are shown from both a buccal (vestibular) and a proximal perspective, along with the cross-sectional anatomy at the coronal, middle, and apical levels. <br><br> <strong>Citations</strong>Grawish, M. E., Grawish, L. M., & Grawish, H. M. (2018). Permanent Maxillary and Mandibular Incisors. Dental Anatomy. <br> <a target='_blank' href='https://www.researchgate.net/publication/326750563_Permanent_Maxillary_and_Mandibular_Incisors'>https://www.researchgate.net/publication/326750563_Permanent_Maxillary_and_Mandibular_Incisors</a> <br> <a target='_blank' href='https://www.intechopen.com/chapters/56461'>https://www.intechopen.com/chapters/56461</a>"
                }
            },
            "Maxillary Canine": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Maxillary_Canine.png",
                    "title": "Pulp Space Anatomy of Individual Tooth: Maxillary Canine",
                    "content": "<strong>Average Tooth Length:</strong> The average length of this tooth is 27 mm, the longest of human teeth. A specimen 33.5 mm in length has been reported.<br><br><strong>Pulp Chamber:</strong> The pulp chambers of the maxillary canines are the largest of any single-rooted teeth. Labiopalatally, the chamber is triangular in shape, with the apex toward the single cusp and a broad base in the cervical third of the crown.<br><br>Mesiodistally, it is narrow, resembling a flame. In cross-section, the chamber is ovoid in shape, with a greater diameter labiopalatally. Only one pulp horn is present, corresponding to one cusp. The division between the pulp chamber and the root canal is indistinct.<br><br> <strong>Root and Root Canal:</strong>The single root canal of the maxillary canine is larger than that of the maxillary incisor. It is wider in labiopalatal than in mesiodistal dimension, and on reaching the middle third, it tapers gradually to an apical constriction.<br><br><strong>Anomalies:</strong> The maxillary canine has two roots in rare cases.<br><br><strong>Clinical Note</strong>• One report noted straight roots in 39% of cases, whereas in 32% the roots curved distally.<br><br>• Lateral canals are present in 30% of cases.<br><br>• The root of the maxillary canine is positioned in the cancellous bone of the maxilla between the nasal cavity and the maxillary sinus, called the canine pillar. The labial surface of the root lies under the labial cortical plate and may fuse with it. Because of its great size, it causes the most prominent bulge in the maxilla, called the alveolar or canine eminence. The size and proximity of the root to the cortical plate may produce fenestrations and dehiscence in that plate.<br><br>• An abscess originating in the maxillary canine usually perforates the labial cortical plate below the insertion of the levator muscles of the upper lip and drains into the buccal vestibule. If the perforation occurs above this insertion, the abscess will drain into the canine space and will cause cellulitis.<br><br>• Apical curettage may be difficult during periradicular procedures because of the length of the tooth.<br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_Canine.png' alt='Image-1'><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_Canine_2.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_Canine_3.png' alt='Image-1'> <br> μCT scans for the maxillary canine. A, Common anatomic presentation. B, Canine with two roots. C, Canine with significant deviations of the canal system in the apical third. All teeth are shown from both a buccal (vestibular) and a proximal perspective, along with the cross-sectional anatomy at the coronal, middle, and apical levels. <br><br> <strong>Citation</strong>Somalinga Amardeep N, Raghu S, Natanasabapathy V. Root canal morphology of permanent maxillary and mandibular canines in Indian population using cone beam computed tomography. Anat Res Int. 2014;2014:731859. <br> <a target='_blank' href='https://www.hindawi.com/journals/ari/2014/731859/'>https://www.hindawi.com/journals/ari/2014/731859/</a>"
                }
            },
            "Maxillary First Premolar": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Maxillary_First_Premolar.png",
                    "title": "Pulp Space Anatomy of Individual Tooth: Maxillary First Premolar",
                    "content": "<strong>Average Tooth Length:</strong> The average length of this tooth is 22.5 mm.<br><br><strong>Pulp Chamber:</strong> The pulp chamber of the maxillary first premolar is narrow mesiodistally. It has a pulp horn under  each cusp, but both may be missed in routine radiographic projections because of superimposition of one over the other. It is wide buccopalatally, and the buccal pulp horn is more prominent than the palatal in young teeth. The floor of the pulp chamber is convex, usually with two canal orifices, one buccal and the other palatal, and it lies deep in the coronal third of the root below the cervical line. In cross-section, the pulp chamber is wide and ovoid in a buccopalatal dimension.<br><br> <strong>Root and Root Canal:</strong> The maxillary first premolar has two roots in 54.6% of cases. In 21.9% of the double-rooted cases, the roots are separated, whereas in 32.7%, the roots are partially fused. When fused roots occur, a groove running in an occlusoapical direction divides the root into buccal and palatal portions, each containing a single root canal. The maxillary first premolar lies in its alveolar socket below the maxillary sinus and is separated from it by a thin layer of spongy and compact bone. The buccal surface of a single- or double-rooted maxillary first premolar is in close proximity to the buccal cortical plate. The proximity of these roots to the cortical plate may produce a fenestration or a dehiscence in that plate.<br><br><strong>Clinical Note</strong>• The buccal canal is directly under the buccal cusp, and its orifice can be penetrated by following the buccal wall of the pulp chamber.<br><br>• The palatal canal is generally the larger of the two canals; it is directly under the palatal cusp, and its orifice can be penetrated by following the palatal wall of the pulp chamber.<br><br>• In teeth with single roots, majority of the roots are straight (38.4%) and an almost equal number have a distal curve (36.8%).<br><br>• Regardless of whether maxillary first premolars has one or two roots, they have two root canals at the apex in 69% of cases.<br><br> <strong>Anomalies:</strong> The maxillary first premolar in rare cases has three root canals.<br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_First_Premolar.png' alt='Image-1'> <br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_First_Premolar_1.png' alt='Image-1'> <br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_First_Premolar_2.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_First_Premolar_3.png' alt='Image-1'> <br> μCT scans of maxillary first premolars. A, Common anatomic presentation of this tooth showing two roots. B, Premolar with only one canal. C, Premolar with three roots. All teeth are shown from both a buccal (vestibular) and a proximal perspective, along with the cross-sectional anatomy at the coronal, middle, and apical levels. <br><br> <strong>Citation</strong>Ahmad IA, Alenezi MA. Root and Root Canal Morphology of Maxillary First Premolars: A Literature Review and Clinical Considerations. J Endod. 2016 Jun;42(6):861-72. <br> <a target='_blank' href='https://www.academia.edu/35809204/Root_and_Root_Canal_Morphology_of_Maxillary_First_Premolars_A_Literature_Review_and_Clinical_Considerations'>https://www.academia.edu/35809204/Root_and_Root_Canal_Morphology_of_Maxillary_First_Premolars_A_Literature_Review_and_Clinical_Considerations</a>"
                }
            },
            "Maxillary Second Premolar": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Maxillary_Second_Premolar.png",
                    "title": "Pulp Space Anatomy of Individual Tooth: Maxillary Second Premolar",
                    "content": "<strong>Average Tooth Length:</strong> The average length of this tooth is 22.5 mm.<br><br><strong>Pulp Chamber:</strong> The maxillary second premolar, like the maxillary first premolar, has a narrow chamber mesiodistally showing one pulp horn superimposed over another when it is viewed in this projection. It is wider buccopalatally than the maxillary first premolar and shows two pulp horns in this projection, a buccal and a palatal. The roof of the pulp chamber is similar to that of the maxillary first premolar, but the pulp floor is deeper if two canals are present.<br><br> <strong>Root and Root Canal:</strong> Maxillary second premolars have only a single root in 90.3% of patients. Only 2% have two well-developed roots, whereas 7.7% have two roots that are partially fused. When two canals occur, they may be distinct and separated along the entire length of the root, or they may converge to form a common canal as they approach the apex.The majority of canals are curved.<br><br><strong>Clinical Note</strong>• If one root canal is present, the root canal orifices will be indistinct, but if two canals are present, two distinct orifices will be visible.<br><br>• The root(s) of the maxillary second premolar are situated below and therefore closer to the maxillary sinus than the maxillary canine. The sinus may dip down and surround the tip of the root(s) forming prominences in the sinus floor.<br><br><strong>Anomalies:</strong> The maxillary second premolar in rare cases has three root canals. <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_Second_Premolar.png' alt='Image-1'> <br>  <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_Second_Premolar_1.png' alt='Image-1'> <br>  <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_Second_Premolar_2.png' alt='Image-1'> <br>  <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_Second_Premolar_3.png' alt='Image-1'> <br> μCT scans of maxillary second premolars. A, Common anatomic presentation showing one canal. B, Second premolar with two canals and an apical delta. C, Second premolar with three roots/canals that divide at the junction of the middle and apical third of the main root. All teeth are shown from both a buccal (vestibular) and a proximal perspective, along with the cross-sectional anatomy at the coronal, middle, and apical levels. <br><br> <strong>Citation</strong>Kartal, N., Özçelik, B., & Cimilli, H. (1998). Root canal morphology of maxillary premolars. <br> <a target='_blank' href='https://www.sciencedirect.com/science/article/abs/pii/S0099239998800241'>https://www.sciencedirect.com/science/article/abs/pii/S0099239998800241</a>"
                }
            },
            "Maxillary First Molar": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Maxillary_First_Molar.png",
                    "title": "Pulp Space Anatomy of Individual Tooth: Maxillary First Molar",
                    "content": "<strong>Average Tooth Length:</strong> The average length of the buccal canals in this tooth is 19 mm and that of the palatal canal is 20.5 mm.<br><br><strong>Pulp Chamber:</strong> The pulp chamber of the maxillary first molar is the largest in the dental arch, with four pulp horns: MB, distobuccal, mesiopalatal, and distopalatal. The arrangement of the horns gives the pulpal roof a rhomboidal shape in cross-section. The four walls forming the roof converge toward the floor where the lingual wall almost disappears; the floor of the pulp chamber thus has a triangular form in cross-section. The orifices of the root canals are located in the three angles of the floor. Anatomic dark lines in the floor of the pulp chamber connect the orifices.<br><br>• The palatal orifice is the largest, round, or oval in shape, and easily accessible for exploration.<br><br>• The MB orifice is under the MB cusp, is long buccopalatally,  and may have a depression at the palatal end in which the orifice of a fourth canal may be present. This orifice is located by insinuating the tip of a long-shank explorer in a mesiobuccoapical inclination into the point angle created at the juncture of the buccal wall, mesial wall, and subpulpal floor of the pulp chamber.<br><br>• The distobuccal orifice is located slightly distal and palatal to the MB orifice and is accessible from the mesial side for exploration. The floor of the pulp chamber is in the cervical third of the root, and the roof is in the cervical third of the crown.<br><br> <strong>Root and Root Canal:</strong>The maxillary first molar has three roots with, usually, three canals situated mesiobuccally, distobuccally, and palatally. The MB canal is not always patent along its entire length and is divided to form a second root canal known as the MB-2 canal. The distobuccal root is small and is more or less round in shape. It usually has a single root canal, which is a narrow and tapering canal. The palatal root has the largest diameter and is the longest root of the maxillary first molar. It is straight in only 40% of cases and may curve buccally (55%).<br><br> <strong>Anomalies</strong>• Maxillary first molar with a single root and a single canal. <br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_First_Molar.png' alt='Image-1'> <br> • Maxillary first molar with two distal canals <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_First_Molar_2.png' alt='Image-1'> <br> • Maxillary first molar with two palatal roots <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_First_Molar_4.png' alt='Image-1'> <br> • Maxillary molar with three MB canals<br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_First_Molar_5.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_First_Molar_6.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_First_Molar_7.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_First_Molar_8.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_First_Molar_9.png' alt='Image-1'> <br> μCT scans of maxillary first molars. A, Common anatomic presentation showing accessory/lateral canals. B, First molar with four canals, with mesiobuccal and mesiopalatal sharing an anastomosis in the midroot. C, Maxillary molar with four pulp horns, five canals, and significant anastomoses between the canals. All teeth are shown from both a buccal (vestibular) and a proximal perspective, along with the cross-sectional anatomy at the coronal, middle, and apical levels. <br><br> <strong>Citation</strong>Cleghorn, B. M., Christie, W. H., & Dong, C. C. S. (2006). Root and Root Canal Morphology of the Human Permanent Maxillary First Molar: A Literature Review. Journal of Endodontics, 32(9), 813-821. <br> <a target='_blank' href='https://www.academia.edu/9971310/Root_and_Root_Canal_Morphology_of_the_Human_Permanent_Maxillary_First_Molar_A_Literature_Review'>https://www.academia.edu/9971310/Root_and_Root_Canal_Morphology_of_the_Human_Permanent_Maxillary_First_Molar_A_Literature_Review</a>"
                }
            },
            "Maxillary Second Molar": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Maxillary_Second_Molar.png",
                    "title": "Pulp Space Anatomy of Individual Tooth: Maxillary Second Molar",
                    "content": "<strong>Average Tooth Length:</strong> The average buccal canal length is 18 mm and the average palatal canal length is 19 mm.<br><br><strong>Pulp Chamber:</strong>The pulp chamber of the maxillary second molar is similar to that of the maxillary first molar, except that it is narrower mesiodistally. Because of this narrower dimension, the roof of the pulp chamber is more rhomboidal in cross-section, the floor of the pulp chamber is an obtuse triangle in cross-section, and the MB and distobuccal canals are closer together and may appear to have a common opening, but they are readily distinguishable from each other. Sometimes, all three canal orifices may be almost in a straight line.<br><br> <strong>Root and Root Canal:</strong>The maxillary second molar usually has three roots, which are closely grouped. Because of this close grouping, the buccal roots may fuse, and occasionally all three roots fuse to form a single conical root. Studies have reported this characteristic in 46% of cases. If the buccal roots fuse to form one buccal root, the tooth may have only two canals, one buccal and one palatal, although it is not unusual to find three canals. A tooth  with only one root usually has only one conical root canal.<br><br><strong>Clinical Note</strong>• The maxillary second molar is usually more closely related to the maxillary sinus than the maxillary first molar.<br><br>• The distobuccal canal will be located more closer to the mesiobuccal canal compared to its location in the maxillary first molar. <br><br> <strong>Anomalies:</strong> The two most frequent anomalies in the maxillary second molar are the presence of only one root and one canal and the incidence of pulp stones in the pulp chamber. The unusual anatomy that has been reported includes: <br><br>• Maxillary second molar with five roots and five canals <br><br>• Maxillary second molar with three MB canals. <br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_Second_Molar.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_Second_Molar_2.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_Second_Molar_3.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_Second_Molar_4.png' alt='Image-1'> <br> μCT scans of maxillary second molars; four possible variations. A, Uncommon anatomic presentation of this tooth with one canal. B, Second molar with two canals. C, Second molar with three canals. D, Second molar with four distinct canals. All teeth are shown from both a buccal (vestibular) and a proximal perspective, along with the cross-sectional anatomy at the coronal, middle, and apical levels. <br><br> <strong>Citations</strong>Versiani MA, Pécora JD, de Sousa-Neto MD. Root and root canal morphology of four-rooted maxillary second molars: a micro-computed tomography study. J Endod. 2012 Jul;38(7):977-82. <br> <a target='_blank' href='https://www.researchgate.net/publication/227163702_Root_and_Root_Canal_Morphology_of_Four-rooted_Maxillary_Second_Molars_A_Micro-Computed_Tomography_Study'>https://www.researchgate.net/publication/227163702_Root_and_Root_Canal_Morphology_of_Four-rooted_Maxillary_Second_Molars_A_Micro-Computed_Tomography_Study</a> <br> <a target='_blank' href='https://www.hindawi.com/journals/ijd/2021/8845442/'>https://www.hindawi.com/journals/ijd/2021/8845442/</a>"
                }
            },
            "Maxillary Third Molar": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Maxillary_Third_Molar.png",
                    "title": "Pulp Space Anatomy of Individual Tooth: Maxillary Third Molar",
                    "content": "<strong>Average Tooth Length:</strong> The average length of this tooth is 17.5 mm.<br><br><strong>Pulp Chamber:</strong>The maxillary third molar anatomically resembles the second molar. The pulp chamber can be similar to that of the maxillary second molar with three canal orifices, but it may also have an oddly shaped chamber with four or five root canal orifices or a conical chamber with only one root canal.<br><br> <strong>Root and Root Canal:</strong>The maxillary third molar may have three well-developed roots that are closely grouped. It may also have fused roots, one conical root, or four or more independent roots. The roots may be straight, curved, or dilacerated, and may be fully or partially developed. Root canals vary from one to four or even five in number, depending on the number of roots. One may find a “C-shaped” pulp chamber with a “C-shaped” root canal.<br><br><strong>Clinical Note</strong>• The maxillary third molar is closely related to the maxillary sinus and the maxillary tuberosity. <br><br> <strong> Anomalies: </strong> The maxillary third molar is a tooth in which anomalies are common, not exceptions. <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_Third_Molar.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_Third_Molar_2.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_Third_Molar_3.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Maxillary_Third_Molar_4.png' alt='Image-1'> <br> μCT scans of maxillary third molars show a range of anatomic variations; A, Single-canal tooth. B, Two rooted third molar. C, Two-rooted, three-canal third molar with significant root curvatures. D, Three-rooted, four-canal third molar. All teeth are shown from both a buccal (vestibular) and a proximal perspective, along with the cross-sectional anatomy at the coronal, middle, and apical levels. <br><br> <strong>Citation</strong>Al-Qudah AA, Bani Younis HAB, Awawdeh LA, Daud A. Root and canal morphology of third molar teeth. Sci Rep. 2023 Apr 27;13(1):6901. <br> <a target='_blank' href='https://www.researchgate.net/publication/370338257_Root_and_canal_morphology_of_third_molar_teeth'>https://www.researchgate.net/publication/370338257_Root_and_canal_morphology_of_third_molar_teeth</a>"
                }
            },
            "Mandibular Central Incisor": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Mandibular_Central_Incisor.png",
                    "title": "Pulp Space Anatomy of Individual Tooth: Mandibular Central Incisor",
                    "content": "<strong>Average Tooth Length:</strong> The average length of this tooth is 21.5 mm.<br><br><strong>Pulp Chamber:</strong>The mandibular central incisor is the smallest tooth in the arch. The pulp chamber is small and flat mesiodistally. The three distinct pulp horns present in a recently erupted tooth become calcified and disappear early in life because of constant masticatory stimulus. Labiolingually, the pulp chamber is wide and ovoid in cross-section in the cervical third of the crown and tapers incisally.<br><br> <strong>Root and Root Canal:</strong>The mandibular central incisor has one root, which is flat and narrow mesiodistally but wide labiolingually. The root is straight in 60% of cases. The canal configuration varies from:<br><br>• One canal exiting in one apical foramen, as in 70% of these teeth, to<br><br>• One canal bifurcating into two canals, coming together, and exiting into one apical foramen (22%).<br><br>From the labiolingual dimension, the canal is broad in the cervical and middle thirds of the root, tapers gradually toward the apex, and forms a constriction in the apical third of the root.<br><br><strong>Clinical Note</strong>• The second canal is normally located lingual to the primary canal.<br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Central_Incisor.png' alt='Image-1'> <br>• Care should be taken during access opening in order to avoid buccal perforations. <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Central_Incisor_1.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Central_Incisor_2.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Central_Incisor_3.png' alt='Image-1'> <br> μCT scans of mandibular central incisors. A, Common anatomic presentation. B, Central incisor with two canals. C, Central incisor with an apical delta. All teeth are shown from both a buccal (vestibular) and a proximal perspective, along with the cross-sectional anatomy at the coronal, middle, and apical levels. <br><br> <strong>Citations</strong>Grawish, M. E., Grawish, L. M., & Grawish, H. M. (2018). Permanent Maxillary and Mandibular Incisors. Dental Anatomy <br> <a target='_blank' href='https://www.researchgate.net/publication/326750563_Permanent_Maxillary_and_Mandibular_Incisors'>https://www.researchgate.net/publication/326750563_Permanent_Maxillary_and_Mandibular_Incisors</a> <br> <a target='_blank' href='https://www.intechopen.com/chapters/56461'>https://www.intechopen.com/chapters/56461</a>"
                }
            },
            "Mandibular Lateral Incisor": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Mandibular_Lateral_Incisor.png",
                    "title": "Pulp Space Anatomy of Individual Tooth: Mandibular Lateral Incisor",
                    "content": "<strong>Average Tooth Length:</strong> The average length of this tooth is 23.5 mm.<br><br><strong>Pulp Chamber:</strong>The configuration of the pulp chamber of the mandibular lateral incisor is similar to that of the mandibular central incisor, but the lateral incisor has larger dimensions.<br><br> <strong>Root and Root Canal:</strong> Although the root of the mandibular lateral incisor is larger than that of the mandibular central incisor, it has basically the same configuration. The majority of the roots are straight or distally or labially curved, as they are in the central incisor, but the distal curve of the lateral incisors is sharper.The incidence of double-root canals at the apex is about the same as in the central incisor, and their anatomy in cross-section is also similar.<br><br> <strong> Anomalies: </strong> Gemination and fusion can occur in mandibular anterior teeth. <br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Lateral_Incisor.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Lateral_Incisor_2.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Lateral_Incisor_3.png' alt='Image-1'> <br> μCT scans of mandibular lateral incisors. A, Common anatomic presentation. B, Lateral incisor with broad, thin buccolingual anatomy. C, Lateral incisor in which the canal splits into two but returns to form one canal apically. All teeth are shown from both a buccal (vestibular) and a proximal perspective, along with the cross-sectional anatomy at the coronal, middle, and apical levels. <br><br> <strong>Citations</strong>Grawish, M. E., Grawish, L. M., & Grawish, H. M. (2018). Permanent Maxillary and Mandibular Incisors. Dental Anatomy <br> <a target='_blank' href='https://www.researchgate.net/publication/326750563_Permanent_Maxillary_and_Mandibular_Incisors'>https://www.researchgate.net/publication/326750563_Permanent_Maxillary_and_Mandibular_Incisors</a> <br> <a target='_blank' href='https://www.intechopen.com/chapters/56461'>https://www.intechopen.com/chapters/56461</a>"
                }
            },
            "Mandibular Canine": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Mandibular_Canine.png",
                    "title": "Pulp Space Anatomy of Individual Tooth: Mandibular Canine",
                    "content": "<strong>Average Tooth Length:</strong> The average length of this tooth is 27 mm.<br><br><strong>Pulp Chamber:</strong>The mandibular canine resembles the maxillary canine, but it is smaller in all dimensions. The pulp chamber is narrow mesiodistally. When viewed labiolingually, the chamber tapers to a point in the incisal third of the crown, but it is wide in the cervical third. Only one pulp horn is present in the adult tooth. In cross-section, the chamber is ovoid in the cervical third. No distinct demarcation exists between the pulp chamber and the root canal.<br><br> <strong>Root and Root Canal:</strong> Although the tooth usually has a single root, it may have two (2.3%). Most of these teeth have a straight root (68%), but some have distal curvatures (20%).The mandibular canine usually has one canal exiting in one apical foramen (78%). When one root canal is present, a labiolingual view of the root shows a canal that is broad in the middle third and tapers to a constriction in the apical third. It is ovoid in cross-section in the cervical and middle thirds of the root and round in the apical third. <br><br> <strong>Anomalies:</strong> The mandibular canine on rare occasions has more than one canal and more than one root. <br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Canine.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Canine_1.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Canine_2.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Canine_3.png' alt='Image-1'> <br> μCT scans of mandibular canines. A, Common anatomic presentation. B, Canine with an extra apical canal. C, Canine that splits into two but returns to one canal apically. All teeth are shown from both a buccal (vestibular) and a proximal perspective, along with the cross-sectional anatomy at the coronal, middle, and apical levels. <br><br> <strong>Citation</strong>Wolf TG, Anderegg AL, Yilmaz B, Campus G. Root Canal Morphology and Configuration of the Mandibular Canine: A Systematic Review. Int J Environ Res Public Health. 2021 Sep 28;18(19):10197. <br> <a target='_blank' href='https://www.researchgate.net/publication/354917388_Root_Canal_Morphology_and_Configuration_of_the_Mandibular_Canine_A_Systematic_Review'>https://www.researchgate.net/publication/354917388_Root_Canal_Morphology_and_Configuration_of_the_Mandibular_Canine_A_Systematic_Review</a>"
                }
            },
            "Mandibular First Premolar": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Mandibular_First_Premolar.png",
                    "title": "Pulp Space Anatomy of Individual Tooth: Mandibular First Premolar",
                    "content": "<strong>Average Tooth Length:</strong> The average length of this tooth is 22.5 mm.<br><br><strong>Pulp Chamber:</strong>The mandibular first premolar is the transitional tooth between anterior and posterior teeth, and in anatomic structure, it resembles both types of teeth. The mesiodistal width of the pulp chamber is narrow. Buccolingually, the pulp chamber is wide, with a prominent buccal pulp horn that extends under a well-developed buccal cusp. In the young tooth, one sees a small lingual pulp horn that may disappear with age and may give the pulp chamber an appearance similar to that of a mandibular canine. The prominent buccal cusp and the smaller lingual cusp give the crown of the mandibular first premolar about a 30° lingual tilt.<br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_First_Premolar.png' alt='Image-1'> <br> In cross-section, the chamber is ovoid, with the greater diameter present in a buccolingual direction. If only one canal is present, no distinct division will be seen between the pulp chamber and the root canal.<br><br> <strong>Root and Root Canal:</strong> The mandibular first premolar usually has a short, conical root. This root may divide in the apical third into two or three roots. The root is usually straight (48%), but some roots curve distally (35%). <br><br>• One canal and one foramen are present in 70% of cases.<br><br>• One canal bifurcates into two canals and exits in two foramina in 24% of cases.<br><br>• Two canals exit in two foramina in 1.5% of cases.<br><br>• One canal bifurcates into two canals, uniting into one canal in the apical third and then exiting in one foramen in 4% of cases.<br><br>• Three canals exit in three foramina in 0.5% of cases.<br><br>If one canal is present, it will be cone shaped and simple in outline. Mesiodistally, such a root canal is narrow; buccolingually, it is broad and tapers toward the apical third. In cross-section, the cervical and middle thirds are ovoid, and the apical third is round.<br><br><strong>Clinical Note</strong> The mental canal and foramen are sometimes close to the root apex of the mandibular first premolar; the radiographic appearance may mimic periradicular pathology.<br><br> <strong> Anomalies:</strong> Bifurcations and trifurcations of the roots or root canals are the most common anomalies. They present a challenge during shaping, cleaning, and obturation. <br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_First_Premolar_1.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_First_Premolar_2.png' alt='Image-1'> <br>  <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_First_Premolar_3.png' alt='Image-1'> <br> μCT scans of mandibular first premolars. A, Common anatomic presentation. B, First premolar with significant canal deviations in the middle to apical third before returning to a single large canal apically and a small deviating canal to the proximal. C, First premolar with a branching main canal lingually and multiple accessory canals. All teeth are shown from both a buccal (vestibular) and a proximal perspective, along with the cross-sectional anatomy at the coronal, middle, and apical levels. <br><br> <strong>Citations</strong>Baisden, M. K., Kulild, J. C., & Weller, R. N. (1992). Root canal configuration of the mandibular first premolar. Journal of Endodontics, 18(10), 505-508. <br> <a target='_blank' href='https://www.hindawi.com/journals/ari/2013/254250/'>https://www.hindawi.com/journals/ari/2013/254250/</a> <br> <a target='_blank' href='https://pubmed.ncbi.nlm.nih.gov/1289476/'>https://pubmed.ncbi.nlm.nih.gov/1289476/</a>"
                }
            },
            "Mandibular Second Premolar": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Mandibular_Second_Premolar.png",
                    "title": "Pulp Space Anatomy of Individual Tooth: Mandibular Second Premolar",
                    "content": "<strong>Average Tooth Length:</strong> The average length of this tooth is 22.5 mm.<br><br><strong>Pulp Chamber:</strong>The pulp chamber of the mandibular second premolar is similar to that of the mandibular first premolar, except that the lingual horn is more prominent under a well-developed lingual cusp. <br><br><strong>Root and Root Canal:</strong> The mandibular second premolar usually has a single root, but on rare occasions two to three roots are present. The root has a greater girth and is wider buccolingually than that of the mandibular first premolar. The root of the mandibular second premolar may curve distally (40%), although in 39% of cases it is straight. Usually, one canal exits in one apical foramen (97.5%), but in some roots (2.5%), a single canal may bifurcate exiting in two foramina. When one canal is present, its configuration is similar to that of the mandibular first premolar. <br><br> <strong>Anomalies:</strong> The mandibular second premolar has two or more roots in rare cases. <br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Second_Premolar.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Second_Premolar_2.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Second_Premolar_3.png' alt='Image-1'> <br> μCT scans of mandibular second premolars. A, Common anatomic presentation. B, Second premolar with significant canal deviations in the middle to apical third. C, Second premolar with fused root that exhibits two distinct canals. All teeth are shown from both a buccal (vestibular) and a proximal perspective, along with the cross-sectional anatomy at the coronal, middle, and apical levels. <br><br> <strong>Citation</strong>NALLAPATI, S. (2005). Three Canal Mandibular First and Second Premolars: A Treatment Approach. A Case Report. Journal of Endodontics, 31(6), 474-476 <br> <a target='_blank' href='http://www.endojamaica.com/downloads/three_canal_premolar_joe.pdf'>http://www.endojamaica.com/downloads/three_canal_premolar_joe.pdf</a>"
                }
            },
            "Mandibular First Molar": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Mandibular_First_Molar.png",
                    "title": "Pulp Space Anatomy of Individual Tooth: Mandibular First Molar",
                    "content": "<strong>Average Tooth Length:</strong> The average length of this tooth is 21.5 mm.<br><br><strong>Pulp Chamber:</strong>The roof of the pulp chamber of the mandibular first molar is often rectangular in shape. The mesial wall is straight, the distal wall round, and the buccal and lingual walls converge to meet the mesial and distal walls and form a rhomboidal floor. The roof of the pulp chamber has four pulp horns: MB, mesiolingual, distobuccal, and distolingual. These four pulp horns recede with age, with a resulting decrease in the size of the pulp chamber. The roof of the pulp chamber is located in  the cervical third of the crown just above the cervix of the tooth, and the floor is located in the cervical third of the root.<br><br>Three distinct orifices are present in the pulpal floor: MB, mesiolingual, and distal.<br><br>• The MB orifice is under the MB cusp and is usually difficult to find and to enter if not enough tooth structure is removed. To penetrate this orifice, insert a long-shank explorer in a mesiobuccoapical inclination into the point angle created at the juncture of the mesial wall, buccal wall, and sub pulpal floor of the pulp chamber.<br><br>• The mesiolingual orifice is located in a depression formed by the mesial and lingual walls. This orifice can be explored from a distobuccal direction. A groove usually connects the orifices of the MB and mesiolingual canals. The MB and mesiolingual orifices may be close together under the MB cusp.<br><br>• The distal orifice, which is oval in shape, with the widest diameter present in a buccolingual direction, can be explored by starting from a mesial direction. If the distal orifice is penetrated in a marked distobuccal or distolingual direction, one should seek an additional orifice and canal in the distal root. The multiple orifices in the distal root are usually found in the buccal and lingual portion of the ovoid coronal root canal.<br><br><strong>Root and Root Canal:</strong> Usually, two well-differentiated roots are present in the mandibular first molar, one mesial and one distal. Both roots are wide and flat buccolingually, with a depression in the middle of the root buccolingually.<br><br> This anatomic characteristic may be accentuated in the mesial root. A third root is found in some cases, either distally or mesially (5.3%), and is often referred to as the radix entomolaris.<br><br>The mesial root curves distally in 84% of cases and is straight in 16%. <br><br>The distal root is straight in 74% of cases, curves to the distal in 21%, and curves to the mesial in 5%.<br><br>Although the mandibular first molar has two roots, three canals are usually present. <br><br><strong>Mesial Root</strong>The mesial root has: <br><br>• Two canals that exit in two foramina in 41% of cases. <br><br>• Two canals that coalesce to exit in one foramen in 28% of cases.<br><br>• Two canals that coalesce to form one canal and bifurcate and exit in two foramina in 13% of cases.<br><br>• One canal that exits in one foramen in 12% of cases.<br><br>• One canal that bifurcates and exits in two foramina in 8% of cases.<br><br>• In rare cases, three canals exit in three foramina and this third canal which is present between the MB and mesiolingual canal orifices is referred to as the middle mesial canal.<br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_First_Molar.png' alt='Image-1'> <br> <strong>Distal Root</strong>The distal root has:<br><br>• One canal exiting in one foramen in 70% of cases.<br><br>• Two canals coalescing and exiting in one foramen in 15% of cases.<br><br>• One canal bifurcating and exiting in two foramina in 8% of cases.<br><br>• Two canals exiting in two foramina in 5% of cases.<br><br>• Two canals coalescing to form one canal and later bifurcating to exit in two foramina in 2% of cases.<br><br>In cross-section, all three canals are ovoid in the cervical and middle thirds and round in the apical third. Two canals present in the distal root are usually round in cross-section from the cervical third to the apical third.<br><br><strong>Clinical Note</strong>The mesial root of the mandibular first molar is in close proximity to the buccal cortical plate, whereas the distal root is centrally located. The apex of the roots of mandibular first molars may be close to the mandibular canal, or they may be at some distance from it, depending on the length of the roots and the height of the body of the mandible.<br><br> <strong>Anomalies:</strong> The mandibular first molar may have three roots and this extra root is often termed radix entomolaris.<br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_First_Molar_1.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_First_Molar_2.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_First_Molar_3.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_First_Molar_4.png' alt='Image-1'> <br> μCT scans of mandibular first molars. A, Common anatomic presentation. B, First molar with three main canals and a deviant fourth canal/fourth root. C, First molar with wide connections or anastomoses between the mesial canals, demonstrating multiple canal exits. All teeth are shown from both a buccal (vestibular) and a proximal perspective, along with the cross-sectional anatomy at the coronal, middle, and apical levels. <br><br> <strong>Citations</strong>Skidmore, A. E., & Bjorndal, A. M. (1971). Root canal morphology of the human mandibular first molar. Oral Surgery, Oral Medicine, Oral Pathology, 32(5), 778-784. <br> <a target='_blank' href='https://doi.org/10.1016/0030-4220(71)90304-5'>https://doi.org/10.1016/0030-4220(71)90304-5</a> <br> <a target='_blank' href='https://www.hindawi.com/journals/ijd/2012/745152/'>https://www.hindawi.com/journals/ijd/2012/745152/</a>"
                }
            },
            "Mandibular Second Molar": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Mandibular_Second_Molar.png",
                    "title": "Pulp Space Anatomy of Individual Tooth: Mandibular Second Molar",
                    "content": "<strong>Average Tooth Length:</strong> The average length of this tooth is 20 mm.<br><br><strong>Pulp Chamber:</strong>The pulp chamber of the mandibular second molar is smaller than that of the mandibular first molar, and the root canal orifices are smaller and closer together.<br><br><strong>Root and Root Canal:</strong> The majority of the mandibular second molars have two roots (71%), but teeth with one root (27%) and teeth with three roots (2%) are also seen. Three root canals are usually present in the mandibular second molar. The most frequent variation is the presence of only two canals.<br><br><strong>Clinical Note</strong>• The relationship between the apex of the root and the mandibular canal may be closer than that of the mandibular first molar.<br><br>• There is a significant incidence of this tooth having two canals only: one mesial and one distal.<br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Second_Molar.png' alt='Image-1'> <br>• The incidence of C-shaped canals is also significantly higher in this tooth compared to in others.<br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Second_Molar_1.png' alt='Image-1'> <br> • On the basis of the 3D reconstructed canal images, the C-shaped canal system can be classified into following three types: <br><br> -- Merging type <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Second_Molar_2.png' alt='Image-1'> <br>  -- Symmetrical type <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Second_Molar_3.png' alt='Image-1'> <br>  -- Asymmetrical type <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Second_Molar_4.png' alt='Image-1'> <br> <strong>Anomalies:</strong> The mandibular second molar may have a third root, or it may have one conical root with one conical canal. <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Second_Molar_5.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Second_Molar_6.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Second_Molar_7.png' alt='Image-1'> <br> μCT scans of mandibular second molars. A, Two-canal second molar with fused roots. B, Second molar with three initial canals ending in one canal apically in both roots. C, Second molar with four distinct canals. All teeth are shown from both a buccal (vestibular) and a proximal perspective, along with the cross-sectional anatomy at the coronal, middle, and apical levels. <br><br> <strong>Citations</strong>Jafarzadeh H, Wu YN. The C-shaped root canal configuration: a review. J Endod. 2007 May;33(5):517-23. <br> <a target='_blank' href='https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4127687/'>https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4127687/</a> <br> <a target='_blank' href='http://oceanmicroendodontics.com/wp-content/uploads/2016/02/C-shaped-canals.pdf'>http://oceanmicroendodontics.com/wp-content/uploads/2016/02/C-shaped-canals.pdf</a>"
                }
            },
            "Mandibular Third Molar": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Mandibular_Third_Molar.png",
                    "title": "Pulp Space Anatomy of Individual Tooth: Mandibular Third Molar",
                    "content": "<strong>Average Tooth Length:</strong> The average length of this tooth is 18 mm.<br><br><strong>Pulp Chamber:</strong>The pulp chamber of the mandibular third molar anatomically resembles the pulp chamber of the mandibular first and second molars. It is large and possesses many anomalous configurations such as C-shaped root canal orifices.<br><br><strong>Root and Root Canal:</strong> The mandibular third molar usually has two roots and two canals, but occasionally one root and one canal or three roots and three canals may be present. The root canals are generally large and short.<br><br><strong>Clinical Significance</strong>•  The alveolar socket of the mandibular third molar may project on to the lingual plate of the mandible. The apex of the root may be in close proximity to the mandibular canal. <br><br> <strong>Anomalies: </strong> The mandibular third molar frequently has a complex anatomic structure. <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Third_Molar.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Third_Molar_2.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Third_Molar_3.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Mandibular_Third_Molar_4.png' alt='Image-1'> <br> μCT scans of mandibular third molars represent multiple variations for this tooth. A, Single C-shaped type canal. B, Complex anatomy with significant canal curvatures apically. C, Three canals that curve in multiple directions. D, Flattened, ribbon-shaped canals with significant apical curvatures. All teeth are shown from both a buccal (vestibular) and a proximal perspective, along with the cross-sectional anatomy at the coronal, middle, and apical levels. <br><br> <strong>Citation</strong>Al-Qudah AA, Bani Younis HAB, Awawdeh LA, Daud A. Root and canal morphology of third molar teeth. Sci Rep. 2023 Apr 27;13(1):6901. <br> <a target='_blank' href='https://www.researchgate.net/publication/370338257_Root_and_canal_morphology_of_third_molar_teeth'>https://www.researchgate.net/publication/370338257_Root_and_canal_morphology_of_third_molar_teeth</a>"
                }
            },
            "Causes": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Causes.png",
                    "title": "Diseases of the Dental Pulp: Causes",
                    "content": "The causes of pulp disease are physical, chemical, and bacterial. They may be grouped as follows:<br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Causes.png' alt='Image-1'> <br> <strong> I. PHYSICAL CAUSES </strong> <br> <strong> A. Mechanical Injuries </strong> These injuries are usually due to either trauma or pathologic wear of teeth. <br> <br> <strong><em> i. Trauma </em> </strong> • A violent blow to the tooth during a fight, sports, automobile accident, or household accident. <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Causes_1.png' alt='Image-1'> <br> • Habits such as opening bobby pins with the teeth and nail biting that may also cause pulpal injury. <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Causes_2.png' alt='Image-1'> <br> <strong><em> ii. Pathologic Wear </em></strong> The pulp may also become exposed or nearly exposed by pathologic wear of the teeth from any of the following: <br><br>• Attrition <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Causes_3.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Causes_4.png' alt='Image-1'> <br> • Abrasion <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Causes_5.png' alt='Image-1'> <br> • Bruxism <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Causes_6.png' alt='Image-1'> <br> • Abfraction <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Causes_7.jpg' alt='Image-1'> <br> If secondary dentin is not deposited rapidly enough, occlusal trauma may also injure the pulp because of repeated irritation to the neurovascular bundle in the periradicular area.<br><br> In addition, certain dental procedures occasionally injure the pulp. Some are avoidable; others are not. The iatrogenic causes of dental injuries include the following: <br><br> • Accidental exposure of the pulp during excavation of carious tooth structure. <br><br> • Too-rapid movement of teeth during orthodontic treatment. <br><br>• Rapid separation of teeth by means of a mechanical separator. <br><br>• The use of pins for mechanical retention of amalgam or other restoration. <br><br> <strong><em> iii. Crown Originating Fracture : COF : (previously known as Cracked Tooth Syndrome) </em></strong> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Causes_8.png' alt='Image-1'> <br> Incomplete fractures through the body of the tooth may cause pain of apparently idiopathic origin. This is referred to as the cracked tooth syndrome.<br><br> <strong><em>  iv. Barodontalgia </em></strong> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Causes_9.jpg' alt='Image-1'> <br> Barodontalgia, also known as aerodontalgia, denotes toothache occurring at low atmospheric pressure experienced either during flight or during a test run in a decompression chamber. It has generally been observed in altitudes over 5,000 feet, but it is more likely to occur at 10,000 feet or above. <br><br><strong> Clinical Note</strong> A tooth with irreversible pulpitis can be symptomless at the ground level, but it may cause pain at high altitude because of reduced pressure. <br><br> <strong> B. Thermal Injuries </strong> Thermal causes of pulp injury are uncommon. <br><br> <strong><em> i. Heat from Tooth Preparation </em></strong> Tooth preparation also produces temperature changes, with an increase of 20°C in temperature during dry tooth preparation 1 mm from the pulp and a 30°C increase 0.5 mm from the pulp. The sensation of pain, a warning signal that the pulp is endangered, is a protective reaction, as it is elsewhere in the body. <br><br>The chief offender is heat developed by a tungsten carbide bur or diamond during tooth preparation. High-speed tungsten carbide burs or diamonds may reduce the operating time but may also accelerate pulp death if used without a coolant. The heat generated may be sufficient to cause irreparable pulp damage. <br><br>When the preparation is large, or when the tooth is being prepared for a full-coverage crown, cutting of dentin is extensive and many dentinal tubules are exposed. <br><br> Evidence suggests that pulpal damage is repaired more rapidly when tooth preparation is done under a water spray. When a preparation is prepared with an air turbine and water spray, the pulp shows little or no response to the cutting. The dentinal tubules remain open or are unaffected for a longer period of time. In comparison with preparation at low speed, it takes longer for reparative or secondary dentin to develop, if it develops at all. <br><br> Extensive research studies on high-speed preparation have shown that- <br><br>• The stream of water or air-water spray must be directed onto the cutting surface of the bur for maximum cooling <br><br>• The water stream is deflected in a centripetal direction by the rotation of the bur <br><br> • Burns in the dentin may occur from overheating because of malfunction of the water spray or stream, with a corresponding reaction in the pulp <br><br> • Aspiration of odontoblast nuclei occurs with inadequate water spray <br><br>• Dry tooth preparation causes not only burns in dentin but also migration of odontoblasts, migration of erythrocytes, and hyperemia of the pulp. <br><br> <strong>Clinical Note</strong> • Studies of sound human teeth in which tooth preparations were done at 200,000 RPM or higher with an air turbine, with adequate water cooling of the tooth, showed less injury to the pulp tissue than when cavities were prepared at speeds between 6,000 and 20,000 RPM, without a coolant. <br><br>• Damage and abscess formation of the pulp occur when a water spray is not used. <br><br> <strong><em>ii. Heat Conduction by Fillings</em></strong> Metallic fillings close to the pulp without an intermediate cement base may conduct temperature changes rapidly to the pulp and may eventually cause irreversible changes. Sudden changes in temperature from foodstuffs, such as eating ice cream, drinking coffee, or chewing ice cubes, may also contribute to pulp injury.<br><br><strong>Clinical Note</strong>Remaining dentin thickness (RDT) under the restoration is the key factor which would determine whether the pulpal changes would be reversible or irreversible in nature. <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Causes_10.png' alt='Image-1'> <br> <strong><em>iii. Frictional Heat During Polishing</em></strong>Enough heat may also be generated during polishing of a filling or during setting of cement to cause at least a transient pulp injury. These injuries are usually reversible in nature. <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Causes_11.png' alt='Image-1'> <br> <strong> Clinical Note </strong>• The pulp responds to hot and cold stimuli that are perceived only as pain.<br><br>• Heat at temperatures between 60°F (16°C) and 130°F (55°C) when applied directly to an intact tooth surface is usually well  tolerated by the pulp, but foodstuffs and beverages above and below this temperature range can also be endured. <br><br> <strong>II. CHEMICALS</strong> Chemical causes of pulp injury are probably the least common. <br><br>The key factors which determine the pulpal reaction to a restorative filling material are as follows:<br><br> • Acidity (pH of the material)<br><br>• Heat generated during the setting reaction <br><br>• Absorption of water during the setting reaction <br><br>• Remaining dentin thickness (RDT) <br><br>• Poor marginal adaptation of the material which might contribute to bacterial leakage <br><br> Fillings made of silver amalgam, or composites, may produce some pulpal reaction when they are inserted in cavities with very less RDT. The deeper the cavity, the greater the damage caused, but in most cases the pulp recovers from these injuries. <br><br> <strong>Clinical Note </strong> The long-term prognosis of a restorative filling would be determined by its ability to inhibit microleakage and pulpal bacterial contamination.<br><br> <strong> III. BACTERIA </strong> The most common cause of pulp injury is bacterial. Bacteria or their products may enter the pulp through a break in the dentin, from caries or accidental exposure, from developmental grooves, from percolation around a restoration, from extension of infection, from the gingiva, or by way of the blood.<br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Causes_12.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Causes_13.png' alt='Image-1'> <br>  <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Causes_14.png' alt='Image-1'> <br> The species of bacteria recovered from inflamed or infected pulps are many and varied. Although lactobacilli (acidogenic organisms) are commonly found in carious dentin, they are seldom recovered from the pulp because of their low degree of invasiveness. <br><br> Microorganisms need not be present in the pulp to produce inflammation: the by-products of bacteria in the dentin may be sufficiently irritating to cause an inflammatory reaction. <br><br> The bacteria most often recovered from infected vital pulps are streptococci and staphylococci, but many other microorganisms including anaerobes have also been isolated. With the introduction of improved methods of molecular identification of pathogens, many new organisms have been identified by researchers. Species that have been found significantly include Porphyromonas gingivalis, Porphyromonas endodontalis, Fusobacterium nucleatum and Treponema denticola. <br><br> <strong> Clinical Note </strong> • The presence or absence of bacterial irritation is the determining factor in pulp survival once the pulp has been mechanically exposed. <br><br>• Once bacteria have invaded the pulp, the damage is almost always irreparable. <br><br> <strong> Reaction of the Pulp to Bacterial Invasion </strong> Once the pulp is exposed by caries or trauma, it is considered infected because microorganisms gain access to it almost immediately. The invading bacteria, however, may be confined entirely to the small area of pulp exposure. At first, the infection is localized to a small area of the pulp, just as infection following a scratch of the arm is localized. Although the coronal area of the pulp may be involved by a mild or even severe infective process, the body and apical portion of the pulp may remain normal. The reaction of the pulp in the involved area is an inflammatory response. <br><br> Polymorphonuclear leukocytes reach the area, and further dissemination of bacteria deeper into the pulp is prevented. Because some microorganisms enter the dentinal tubules, they may gain a foothold that is difficult to dislodge. In this respect, injury of the pulp and injury of the arm or some other parts of the body differ; in the latter, microorganisms are more readily reached by tissue defenses. The reaction in an inflamed pulp also differs from that in an inflamed arm or other organ in that little or no room is provided during the inflammatory state for swelling of the pulp because the pulp is entirely enclosed in a hard, unyielding dentinal wall, except at the apical foramen. If the inflammatory process is severe, it will extend deeper into the pulp and all the symptoms of an acute reaction will be manifested. <br><br> Considerable inflammatory exudate accumulates and causes pain from pressure on the nerve endings. Areas of necrosis develop, owing to disturbance in nutritional supply, many of the polymorphonuclear leukocytes die, and pus forms, further irritating the nerve cells. If the process is less severe, lymphocytes and plasma cells will replace the polymorphonuclear leukocytes in numbers, and the inflammatory reaction may be confined to the surface of the pulp. Such a chronic inflammatory state may be localized for a long time unless the microorganisms penetrate deeper into the pulp and cause an acute reaction manifested by a clinical flare-up. <br><br>On the other hand, the chronic process may continue until most of, or all the pulp is involved, ultimately leading to its death. In the course of this development, the organisms may be killed, but more commonly they survive and set up a reaction in the periapical tissue by their products of metabolism. During the inflammatory reaction, tissue pressure is increased. Stasis occurs with resulting necrosis of the pulp. In some cases, the necrotic but sterile pulp tissue causes no symptoms and remains quiescent for years. This situation is an exception, because in most cases the microorganisms survive, and if virulent, multiply rapidly and reach the periapical tissue, where they continue their destruction and produce an acute alveolar abscess. If they are less virulent, the microorganisms will remain in the root canal and, by their toxic products, will gradually and quietly produce a chronic abscess without giving rise to subjective symptoms other than those associated with a sinus tract, if one develops. When the defensive forces of the periradicular tissues are adequate, a ring of granulation tissue is formed to delimit the bacteria and neutralize their toxins. In some cases, such low-grade irritation stimulates the epithelial rests and causes a cyst. <br><br>Meanwhile, during this process, the dentinal tubules may become infiltrated with products of blood decomposition, bacteria, and, occasionally, food debris, and the dentin becomes discolored. Such discoloration of tooth structure is sometimes the first clinical sign that the pulp has died. <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Causes_15.jpg' alt='Image-1'> <br><br> <strong>Citations</strong>1. Singh, G., Paul R, S., Arora, A., Kumar, S., Jindal, L., & Raina, S. (2020). Disease of Pulp and Periradicular Tissue: An Overview. Journal of Current Medical Research and Opinion, 3(10). <br> <a target='_blank' href='https://www.researchgate.net/publication/346244739_Disease_of_Pulp_and_Periradicular_Tissue_An_Overview'>https://www.researchgate.net/publication/346244739_Disease_of_Pulp_and_Periradicular_Tissue_An_Overview</a> <br> 2. Abbott, P., & Yu, C. (2007). A clinical classification of the status of the pulp and the root canal system. Australian Dental Journal, 52, S17-S31. <br> <a target='_blank' href='https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1834-7819.2007.tb00522.x'>https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1834-7819.2007.tb00522.x</a>"
                }
            },
            "Pulp Space": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Pulp_Space.png",
                    "title": "Pulp Space Anatomy: Pulp Space",
                    "content": "The pulp space is the central cavity within a tooth and is entirely enclosed by dentin except at the apical foramen. The pulp space may be divided into the following: <br><br>• A coronal portion → Pulp chamber <br><br>• A radicular portion → Root canal <br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Pulp_Space.jpg' alt='Image-1'> <br><br> <strong>Citation</strong>Krasner P, Rankow HJ. Anatomy of the pulp-chamber floor. J Endod. 2004;30(1):5-16. <br> <a target='_blank' href='https://personal.us.es/segurajj/documentos/PTD-III/Art%C3%ADculos%20primer%20parcial/Krasner_and_Rankow_JOE_2004.pdf'>https://personal.us.es/segurajj/documentos/PTD-III/Art%C3%ADculos%20primer%20parcial/Krasner_and_Rankow_JOE_2004.pdf</a>"
                }
            },
            "Pulp Chamber": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Pulp_Chamber.png",
                    "title": "Pulp Space Anatomy: Pulp Chamber",
                    "content": "In anterior teeth, the pulp chamber gradually merges into the root canal, and this division becomes indistinct. <br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Pulp_Chamber_1.jpg' alt='Image-1'> <br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Pulp_Chamber_2.jpg' alt='Image-1'> <br><br> In multirooted teeth, the pulp space consists of a single pulp chamber and usually three root canals, although the number of canals can vary from one to four or more.<br><br> • Roof of the pulp chamber consists of dentin covering the pulp chamber occlusally or incisally.<br><br>• Pulp horn is an accentuation of the roof of the pulp chamber directly under a cusp or developmental lobe. The term refers more commonly to the prolongation of the pulp itself directly under a cusp. <br><br>• Floor of the pulp chamber runs parallel to the roof and consists of dentin bounding the pulp chamber near the cervical area of the tooth, particularly dentin forming the furcation area. <br><br>• The canal orifices are openings in the floor of the pulp chamber leading into the root canals. The canal orifices are not separate structures but are continuous with both the pulp chamber and the root canals. The walls of the pulp chamber derive their names from the corresponding walls of the tooth surface, such as the buccal wall of a pulp chamber. The angles of a pulp chamber derive their names from the walls forming the angle, such as the mesiobuccal (MB) angle of a pulp chamber.<br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Pulp_Chamber_3.png' alt='Image-1'> <br><br> <strong>Citation</strong>Krasner P, Rankow HJ. Anatomy of the pulp-chamber floor. J Endod. 2004;30(1):5-16. <br> <a target='_blank' href='https://personal.us.es/segurajj/documentos/PTD-III/Art%C3%ADculos%20primer%20parcial/Krasner_and_Rankow_JOE_2004.pdf'>https://personal.us.es/segurajj/documentos/PTD-III/Art%C3%ADculos%20primer%20parcial/Krasner_and_Rankow_JOE_2004.pdf</a>"
                }
            },
            "Root Canals": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Root_Canals.png",
                    "title": "Pulp Space Anatomy: Root Canals",
                    "content": "The root canal is the portion of the pulp space from the canal orifice to the apical foramen. For convenience, it may be divided into three sections, namely: coronal, middle, and apical thirds.<br><br> • Accessory canals, or lateral canals, are lateral branching of the main root canal generally occurring in the apical third or furcation area of a root.<br><br> • Lateral canal is an accessory canal that branches to the lateral surface of the root and may be visible on a radiograph.<br><br> • Apical foramen is an aperture at or near the apex of a root through which the blood vessels and nerves of the pulp enter or leave the pulp cavity.<br><br> • Accessory foramina are the openings of the accessory and lateral canals in the root surface. <br><br>A straight root canal extending the entire length of the root is uncommon. Either a constriction is present before the apex is reached or, as is often the case, a curvature is present. <br><br> The curvature may be: <br><br>• A straight canal extending with minimal apical curvature. <br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Root_Canals_1.jpg' alt='Image-1'> <br> • A gradual curvature of the canal with a straight apical ending. <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Root_Canals_2.png' alt='Image-1'> <br> • A gradual curvature of the entire canal <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Root_Canals_3.png' alt='Image-1'> <br> • A sharp curvature of the canal near the apex. <br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Root_Canals_4.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Root_Canals_5.png' alt='Image-1'> <br> A curvature of about 20° in a narrow root canal may be difficult or even impossible to negotiate with endodontic instruments, whereas a curvature of even 30° may be negotiated if the root canal is wide. <br><br> Success in negotiating a narrow, curved canal depends on the following: <br><br> • Degree of curvature <br><br> • Size and constriction of the root canal <br><br> • Size and flexibility of the endodontic instrument blade <br><br> • Skill of the operator <br><br> <strong>Clinical Note</strong> In most cases, the number of root canals corresponds with the number of roots, but a root may have more than one canal. <br><br> • Mesial root of the mandibular first molar almost always has two canals, which sometimes meet in a common foramen. <br><br> • Distal root of the mandibular first molar occasionally has two canals. <br><br> • Mesiobuccal root of the maxillary first molar frequently has two canals. <br><br> • Pulp chamber of a mandibular anterior or premolar tooth may be bifurcated to present two separate root canals."
                }
            },
            "Vertucci's Classification": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Vertucci_Classification.png",
                    "title": "Pulp Space Anatomy: Vertucci's Classification",
                    "content": "• Type I: Single canal extends from the pulp chamber to the apex. (1) <br><br> • Type II: Two separate canals leave the pulp chamber and join short of the apex to form one canal. (2-1) <br><br>• Type III: One canal leaves the pulp chamber and divides into two in the root; the two then merge to exit as one canal. (1-2-1) <br><br>• Type IV: Two separate distinct canals extend from the pulp chamber to the apex. (2) <br><br>• Type V: One canal leaves the pulp chamber and divides short of the apex into two separate distinct canals with separate apical foramina. (1-2) <br><br>• Type VI: Two separate canals leave the pulp chamber, merge in the body of the root, and redivide short of the apex to exit as two distinct canals. (2-1-2) <br><br>• Type VII: One canal leaves the pulp chamber, divides, and then rejoins in the body of the root, and finally redivides into two distinct canals short of the apex. (1-2-1-2) <br><br>• Type VIII: Three separate distinct canals extend from the pulp chamber to the apex. (3) <br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Vertucci_Classification.png' alt='Image-1'><br><br>Vertucci's root canal configurations. Above: diagrammatic representation of 8 different root canal configurations found by Vertucci et al. (1974) using 200 cleared maxillary second premolars, which had their pulp cavities stained with dye. Below: three-dimensional micro-computed tomographic models of different teeth representing the Vertucci's root canal configurations. <br><br> <strong>Citation</strong>Vertucci, F.J. (2005) Root Canal Morphology and Its Relationship to Endodontic Procedures. Endodontic Topics, 10, 3-29.<br> <a target='_blank' href='https://www.academia.edu/4182574/2005_Vertucci_Root_canal_morphology_and_its_relationship_to_endodontic_procedures'>https://www.academia.edu/4182574/2005_Vertucci_Root_canal_morphology_and_its_relationship_to_endodontic_procedures</a>"
                }
            },
            "Weine's Classification": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Weine_Classification.png",
                    "title": "Pulp Space Anatomy: Weine's Classification",
                    "content": "• Type I: Single canal from the pulp chamber to the apex <br><br> • Type II: Two canals leaving the chamber and merging to form a single canal short of the apex <br><br>• Type III: Two separate and distinct canals from the chamber to the apex <br><br>• Type IV: One canal leaving the chamber and dividing into two separate and distinct canals <br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Weine_Classification.png' alt='Image-1'><br><br>Weine's classification of root canal anatomy: (a) Type I. (b) Type II. (c) Type III. (d) Type IV."
                }
            },
            "Classification based on Canal Cross-section": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Classification_based_on_Canal_Cross-section.png",
                    "title": "Pulp Space Anatomy: Classification based on Canal Cross-section",
                    "content": "According to Jou et al., canals can vary based on their anatomy cross-sectionally:<br><br>• Round (circular)<br><br>• Oval<br><br>• Long oval<br><br>• Flattened (flat/ribbon)<br><br>• Irregular <br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Classification_based_on_Canal_Cross-section_1.jpg' alt='Image-1'><br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Classification_based_on_Canal_Cross-section_2.jpg' alt='Image-1'> <br><br> <strong>Citation</strong> <a target='_blank' href='https://www.mdpi.com/2076-3417/10/13/4495'>https://www.mdpi.com/2076-3417/10/13/4495 </a>"
                }
            },
            "Isthmus": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Isthmus.png",
                    "title": "Pulp Space Anatomy: Isthmus",
                    "content": "Kim et al. have classified the isthmus into the following categories: <br><br>• Type I: Faint communication between two canals<br><br>• Type II: Complete isthmus with a definite connection between two canals<br><br>• Type III: A complete but very short isthmus between two canals<br><br>• Type IV: Complete or incomplete isthmus between three or more canals<br><br>• Type V: Two or three canal openings without visible connections<br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Isthmus.png' alt='Image-1'><br> <strong>Citations</strong> <a target='_blank' href='https://suffolkrootcanal.co.uk/wp-content/uploads/2015/04/31-T.-Von-Arx-2005.pdf'>https://suffolkrootcanal.co.uk/wp-content/uploads/2015/04/31-T.-Von-Arx-2005.pdf</a> <br> <a target='_blank' href='https://www.mdpi.com/2076-3417/10/13/4495'>https://www.mdpi.com/2076-3417/10/13/4495</a>"
                }
            },
            "Apical Foramen": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Apical_Foramen.png",
                    "title": "Pulp Space Anatomy: Apical Foramen",
                    "content": "• In young, incompletely developed teeth, the apical foramen is funnel shaped, with the wider portion extending outward. The mouth of the funnel is filled with periodontal tissue that is later replaced by dentin and cementum. <br><br>• As the root develops, the apical foramen becomes narrower.<br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Apical_Foramen.png' alt='Image-1'><br> Various courses taken by root canals and locations of apical foramina: (a) Curved root canal with the apical foramen distant from the root apex. (b) Curved root canal with the foramen near the apex. (c) Constricted root canal as the apical foramen is approached. (d) Double curvature of the root canal with the foramen at a distance from the root apex. <br><br>• The inner surface of the root apex becomes lined with cementum, which may even extend for a short distance (1 mm or so) into the root canal. The cementodentinal junction (CDJ), therefore, does not necessarily occur at the extreme end of the root, but may occur within the main root canal.<br><br> <strong>• Apical constrictions are found 0.5-1.0 mm away from the root apex.</strong> <br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Apical_Foramen_2.jpg' alt='Image-1'><br> • The apical foramen is not always the most constricted portion of the root canal. Constrictions can and do occur before the extremity of the root is reached. <br><br>• The apical foramen is not always located in the center of the root apex. It may exit on the mesial, distal, labial, or lingual surface of the root, usually slightly eccentrically.<br><br>• Anatomic studies have shown that the apical foramen coincides within the anatomic apex in only 17-46% of cases and it is located at an average of 0.4-0.7 mm away from the anatomic apex. In a few cases, the apical foramen has been found as much as 2-3 mm away from the anatomic apex. <br><br> <strong>Clinical Note</strong>• Studies have led to the recommendation that root canal obturation should end approximately 0.5-1.0 mm short of the anatomic root apex as seen in the radiograph. <br><br>• It is not necessary to shape, clean, or fill root canals to their anatomic apices, but rather to the cementodentinal junction, which usually lies within the canal just short of the apex. <br><br>Knowledge of the age at which calcification of the root apex occurs is essential for endodontic practice, particularly when dealing with pulp-involved or pulpless teeth of children and young persons. As a general rule, a root apex is completely formed about 2-3 years after eruption of the tooth. Table 13.1 gives the approximate time (in years) of eruption of the teeth and calcification of the root apices. Endodontic treatment of young teeth does not affect normal eruption. <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Apical_Foramen_3.png' alt='Image-1'> <br><br> <strong>Citation</strong> <a target='_blank' href='https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4414262/'>https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4414262/</a>"
                }
            },
            "Lateral Canals and Accessory Foramina": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Lateral_Canals_and_Accessory_Foramina.png",
                    "title": "Pulp Space Anatomy: Lateral Canals and Accessory Foramina",
                    "content": "• Lateral canals and accessory foramina have been found with enough regularity to prove that they are integral parts of a normal pulp space rather than exceptions. <br><br>• The periodontal vessels curve around the root apex of a developing tooth and often become entrapped in Hertwig's epithelial root sheath, resulting in the formation of lateral canals and accessory foramina during calcification.<br><br>• This phenomenon frequently occurs in the apical third of the root which explains the high incidence of lateral canals and accessory foramina in the apical third.<br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Lateral_Canals_and_Accessory_Foramina.jpg' alt='Image-1'><br><br>• Lateral canals may also occur in the area of bifurcation or trifurcation of multirooted teeth. These canals result from the entrapment of the periodontal vessels during the fusion of the parts of the diaphragm that become the floor of the pulp chamber. The reported incidence of lateral canals ranges from 27.4 to 35.5%. <br><br>• Pulp tissue lies within a dentinal enclosure of the accessory or lateral canal. When the pulp is removed, the blood vessels lying within the accessory or lateral canals are sealed or obliterated by cementum, unless injury occurs, whether mechanical, chemical, or bacterial. With increasing age, the accessory foramina diminish in number because of calcification of their contained soft tissue. <br><br> <strong>Citation</strong> <a target='_blank' href='https://onlinelibrary.wiley.com/doi/10.1111/iej.12800'>https://onlinelibrary.wiley.com/doi/10.1111/iej.12800</a>"
                }
            },
            "Influence of aging on pulp space": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Influence_of_aging_on_pulp_space.png",
                    "title": "Pulp Space Anatomy: Influence of aging on pulp space",
                    "content": "The size and shape of the pulp space are influenced by age.<br><br><img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Influence_of_aging_on_pulp_space.png' alt='Image-1'><br> <strong>Citation</strong>Maeda H (2020) Aging and Senescence of Dental Pulp and Hard Tissues of the Tooth. Front. Cell Dev. Biol. 8:605996. <br> <a target='_blank' href='https://www.readcube.com/articles/10.3389/fcell.2020.605996'>https://www.readcube.com/articles/10.3389/fcell.2020.605996</a>"
                }
            },
            "Anomalies of Pulp Cavities": {
                "card_content": {
                    "img": "./src/assets/Dental_Pulp/Sub_Categories/Banner/Anomalies_of_Pulp_Cavities.jpg",
                    "title": "Pulp Space Anatomy: Anomalies of Pulp Cavities",
                    "content": "Certain developmental anomalies of the pulp cavities may render the execution of endodontic procedures difficult or impossible.<br><br>• In dentinogenesis imperfecta, the pulp cavities may be small or even obliterated.<br><br>• Hyperparathyroidism may cause pulp calcification and loss of lamina dura.<br><br>• Hypofunction of the pituitary gland may lead to retarded eruption of teeth and to open root apices. <br><br>• Dentinal dysplasia is a hereditary condition characterized by obliteration of the pulp chamber and defective root formation. In some cases of dentinal dysplasia, the root development is disturbed, with obliteration of the root canals. <br><br> <strong>TAURODONTISM</strong> Taurodontism is characterized by a short tooth and a much-larger-than-normal pulp chamber. <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Taurodontism.png' alt='Image-1'><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Taurodontism_2.jpg' alt='Image-1'><br> Taurodontism is probably due to a lack of invagination of the epithelial root sheath during development. It may be considered an ethnic or familial trait because it occurs in family groups, such as in Eskimos.<br><br> <strong>DENS IN DENTE</strong> A dens in dente is an invagination within the crown or root of the lingual surface of the tooth. This invagination creates a space within the tooth that is lined with enamel and communicates with the oral cavity. This malformation or anomaly may occur in any anterior tooth, but it is most often observed in maxillary lateral incisors. At times, more than one tooth is affected. Invagination of the lingual enamel of maxillary incisor teeth often causes widening of the pulp chamber. <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Dens_in_Dente.jpg' alt='Image-1'><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Dens_in_Dente_2.jpg' alt='Image-1'><br> Such teeth are predisposed to decay because of the anatomic malformation, and pulp disease may result before the root apex is fully developed. Intentional filling of the defect may prevent pulp involvement in such cases. <br><br> <strong>DENS EVAGINATUS</strong> Dens evaginatus is a developmental anomaly that produces an extra cusp-like structure, usually in the area of the transverse ridge of premolars. <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Dens_Evaginatus.jpg' alt='Image-1'><br> It is formed during early tooth development by the proliferation and evagination of the enamel epithelium into the stellate reticulum, with resulting protuberance of enamel and dentin with a pulp horn. The cusp-like structure is subject to wear or fracture that exposes the pulp, with the sequelae of pulp and periapical disorders. <br><br>Although this anomaly is predominantly found in persons of Mongolian ancestry, it has also been reported in Caucasians. The majority of cases reported have been in premolars, but incisors, cuspids, and molars have also been involved. Dens evaginatus can occur unilaterally or bilaterally. <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Dens_Evaginatus_2.jpg' alt='Image-1'><br><br> <strong>PALATOGINGIVAL DEVELOPMENTAL GROOVE</strong> A palatogingival developmental groove may be present in maxillary central and lateral incisors. <br><br> <img class='image-center' src='./src/assets/Dental_Pulp/Sub_Categories/Palatogingival_Developmental_Groove.png' alt='Image-1'><br> This groove, which appears as an invagination of the enamel, originates in the cingulum of the incisors, and ends apically at various levels of the root. It is believed that it is an attempt by the tooth bud to form a second root. Once the integrity of the periodontal attachment is broken in the area of the anomaly, a probable linear periodontal defect will develop to the level of the groove apically. The result is a self-perpetuating periodontal defect. <br><br> Radiographically, the lesion created by the anomaly produces a radiolucency along the length of the groove. This radiolucency can be differentiated from a vertical root fracture by the clinical presence of the developmental groove.  <br><br> <strong>Citations</strong> <br><strong><em>Anomalies of Pulp Cavities</em></strong> Ahmed HMA, Dummer PMH. A new system for classifying tooth, root and canal anomalies. Int Endod J. 2018 Apr;51(4):389-404. <br> <a target='_blank' href='https://onlinelibrary.wiley.com/doi/10.1111/iej.12867'>https://onlinelibrary.wiley.com/doi/10.1111/iej.12867</a> <br> <strong><em>Taurodontism</em></strong> Chetty, M., Roomaney, I.A. & Beighton, P. Taurodontism in dental genetics. BDJ Open 7, 25 (2021). <br> <a target='_blank' href='https://www.researchgate.net/publication/353133412_Taurodontism_in_dental_genetics'>https://www.researchgate.net/publication/353133412_Taurodontism_in_dental_genetics</a> <br> <a target='_blank' href='https://www.nature.com/articles/s41405-021-00081-6'>https://www.nature.com/articles/s41405-021-00081-6</a> <br> <strong> <em>Dens in Dente</em> </strong>1. Chen, Y.-H. M., Tseng, C.-C., & Harn, W.-M. (1998). Dens invaginatus. Oral Surgery, Oral Medicine, Oral Pathology, Oral Radiology, and Endodontology, 86(3), 347-352. <br> <a target='_blank' href='https://www.academia.edu/33340634/Endodontic_Treatment_Of_Dens_Invaginatus_With_A_Periradicular_Lesion_Case_Report'>https://www.academia.edu/33340634/Endodontic_Treatment_Of_Dens_Invaginatus_With_A_Periradicular_Lesion_Case_Report</a> <br> 2. Thakur S, Thakur NS, Bramta M, Gupta M. Dens invagination: A review of literature and report of two cases. J Nat Sci Biol Med. 2014 Jan;5(1):218-21. <br> <a target='_blank' href='https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3961942/'>https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3961942/</a> <br> <strong><em>Dens Evaginatus</em></strong>Levitan, M. E., & Himel, V. T. (2006). Dens Evaginatus: Literature Review, Pathophysiology, and Comprehensive Treatment Regimen. Journal of Endodontics, 32(1), 1-9. <br> <a target='_blank' href='https://www.academia.edu/14686278/Review_Article_Dens_Evaginatus_Literature_Review_Pathophysiology_and_Comprehensive_Treatment_Regimen'>https://www.academia.edu/14686278/Review_Article_Dens_Evaginatus_Literature_Review_Pathophysiology_and_Comprehensive_Treatment_Regimen</a> <br> <strong><em>Palatogingival Developmental Groove</em></strong> 1. Sharma S, Deepak P, Vivek S, Ranjan Dutta S. Palatogingival Groove: Recognizing and Managing the Hidden Tract in a Maxillary Incisor: A Case Report. J Int Oral Health. 2015 Jun;7(6):110-4. <br> <a target='_blank' href='https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4479763/'>https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4479763/</a> <br> 2. Kim HJ, Choi Y, Yu MK, Lee KW, Min KS. Recognition and management of palatogingival groove for tooth survival: a literature review. Restor Dent Endod. 2017 May;42(2):77-86. <br> <a target='_blank' href='https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5426222/'>https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5426222/</a>"
                }
            }
        }
    },
    
    "Zones of Pulp": {
        "img": "./src/assets/Zones_of_Pulp/Zones_of_Pulp.png",
        "card_content": {
            "title": "Zones of Pulp",
            "content": "Starting at the periphery, the pulp is divided into four zones: <br><br>I. Odontoblastic zone, which surrounds the periphery of the pulp. <br><br> II. Cell-free zone <br><br> III. Cell-rich zone <br><br> IV. Central zone"
        },
        "categories": {
            "Odontoblastic Zone": {
                "card_content": {
                    "img": "./src/assets/Zones_of_Pulp/Categories/Banner/Odontoblastic_Zone.png",
                    "title": "Zone of Pulp: Odontoblastic Zone",
                    "content": "The odontoblasts are specialized cells that generally last the entire life of the tooth. They consist of cell bodies and their cytoplasmic processes. The odontoblastic cell bodies form the odontoblastic zone, whereas the odontoblastic processes are located within the predentin matrix and the dentinal tubules, extending into the dentin. In this odontoblastic zone, capillaries and unmyelinated sensory nerves are found around the odontoblastic cell bodies. The odontoblasts lining the predentin represent the link between the dentin and the pulp. They are the matrix-producing cells and show characteristic features associated with protein synthesis. <br><br> <img class='image-center' src='./src/assets/Zones_of_Pulp/Sub_Categories/Odontoblastic_Zone.png' alt='Image-1'> <br><br> <strong> Clinical Note </strong> The primary function of the odontoblasts throughout the life of the pulp is the production and deposition of dentin. <br><br> <strong>Histology</strong> In histologic sections, the odontoblasts appear to be lined up in a palisading arrangement at the periphery of the pulp. The cell bodies of the odontoblasts have junctional complexes, such as gap junctions, which unite the cells and allow an interchange of metabolites. These cytoplasmic bridges among odontoblasts may explain the palisading formation and the action in unison of these cells. These cell bodies vary in size, shape, and arrangement from the coronal pulp to the apical pulp. In the coronal pulp, the odontoblasts are tall, columnar cells with a nucleus polarized toward the center of the pulp. They change shape gradually to flattened cells in the apical third, and their arrangement changes from a six- to eight-cell layer in the pulp horns to a one-cell layer in the apical pulp. <br><br>  <img class='image-center' src='./src/assets/Zones_of_Pulp/Sub_Categories/Odontoblastic_Zone_3.jpg' alt='Image-1'> <br><br> <strong> Clinical Note </strong> • The crowded arrangement of the coronal odontoblasts is due to the rapid reduction of the pulp chamber by the deposition of dentin, which compresses the existing cells to a stratified layer. <br><br> • This crowding of odontoblasts produces more cells per unit area and, therefore, more dentinal tubules (45,000/mm2) in the pulpal side than in the enamel side (20,000/mm2). <br><br>  <img class='image-center' src='./src/assets/Zones_of_Pulp/Sub_Categories/Odontoblastic_Zone_5.png' alt='Image-1'> <br><br> As a result of this phenomenon, the configuration of the dentinal tubules in these areas is “S” shaped. Reduction of odontoblasts per unit area produces fewer tubules and results in a straighter course, as seen in the cervical third of the root or beneath the incisal edges or cusps. Further reduction in the number of cells and, consequently, in the number of dentinal tubules produces dentin typically found in the apical third. The presence of “S”-shaped tubules is a consideration in clinical endodontic practice. Operative procedures in areas with such tubules produce inflammatory changes in the odontoblastic layer further apically than expected."
                },
                "sub_categories": [
                    "Predentin Layer",
                    "Odontoblastic Processes",
                    "Incremental Lines",
                    "Dentinal Tubules",
                    "Primary Dentin",
                    "Secondary Dentin",
                    "Tertiary Dentin"
                ]
            },
            "Cell Free Zone": {
                "card_content": {
                    "img": "./src/assets/Zones_of_Pulp/Categories/Banner/Cell_Free_Zone.png",
                    "title": "Zone of Pulp: Cell Free Zone",
                    "content": "The cell-free zone, or zone of Weil, is a relatively acellular zone of the pulp, located centrally to the odontoblast zone. This zone, although called cell-free, contains some fibroblasts, mesenchymal cells, and macrophages.  <br><br> <img class='image-center' src='./src/assets/Zones_of_Pulp/Sub_Categories/Cell_Free_Zone.png' alt='Image-1'><br>  Fibroblasts are involved in the production and maintenance of the reticular fibers found in this zone. When odontoblasts are destroyed by noxious stimuli, mesenchymal cells and fibroblasts differentiate into new odontoblasts. Macrophages are present for the phagocytosis of debris. The main constituents of this zone are a plexus of capillaries, the nerve plexus of Raschkow, and the ground substance. The capillary plexus is involved in the nutrition of the odontoblasts and the cells of the zone and is conspicuous only during periods of dentinogenesis and inflammation.<br><br> The ground substance is involved in the metabolic exchanges of the cells and limits the spread of infection because of its consistency. The zone of Weil is more prominent in the coronal pulp, but it may be completely absent during periods of dentinogenesis. <br><br> <strong> Clinical Note </strong> The unmyelinated nerve plexus of Raschkow is involved in the neural sensation of the pulp."
                },
                "sub_categories": []
            },
            "Cell Rich Zone": {
                "card_content": {
                    "img": "./src/assets/Zones_of_Pulp/Categories/Banner/Cell_Rich_Zone.png",
                    "title": "Zone of Pulp: Cell Rich Zone",
                    "content": "The cell-rich zone is located central to the cell-free zone. Its main components are ground substance, fibroblasts with their product, i.e., the collagen fibers, undifferentiated mesenchymal cells, and macrophages.<br><br><img class='image-center' src='./src/assets/Zones_of_Pulp/Categories/Cell_Rich_Zone.png' alt='Image-1'>"
                },
                "sub_categories": [
                    "Ground Substance",
                    "Fibroblasts",
                    "Undifferentiated Mesenchymal Cells",
                    "Macrophages, Lymphocytes, and Plasma Cells"
                ]
            },
            "Central Zone": {
                "card_content": {
                    "img": "./src/assets/Zones_of_Pulp/Categories/Banner/Central_Zone.png",
                    "title": "Zone of Pulp: Central Zone",
                    "content": "The central zone or pulp proper contains blood vessels and nerves that are embedded in the pulp matrix together with fibroblasts. From their central location, the blood vessels and the nerves send branches to the periphery of the pulp."
                },
                "sub_categories": [
                    "Blood Vessels of Pulp",
                    "Lymphatic Drainage",
                    "Innervation"
                ]
            }
        },
        "sub_categories": {
            "Predentin Layer": {
                "card_content": {
                    "img": "./src/assets/Zones_of_Pulp/Sub_Categories/Banner/Predentin_Layer.png",
                    "title": "Odontoblastic Zone: Predentin Layer",
                    "content": "Dentinogenesis includes the production, deposition, and calcification of the matrix. This matrix is the predentin layer deposited around the odontoblastic processes and is found between the calcified dentin and the odontoblastic zone.<br> <img class='image-center' src='./src/assets/Zones_of_Pulp/Sub_Categories/Predentin_Layer.jpg' alt='Image-1'> <span>Dentinal tubules, pulpal view. This image shows predentin with dentinal tubules. This is the pulpal side of the dentin. The odontoblasts have been removed (scanning electron microscopy [SEM]). (Courtesy: Randi F. Klinge, University of Oslo, Norway.) </span> This predentin layer, elaborated by the odontoblasts, is a protein-carbohydrate complex consisting of proteoglycans, phosphoproteins, plasma proteins, glycoproteins, and collagen fibrils. Calcium and phosphorus salts are deposited into this matrix to produce the mineralized structure known as dentin. The pattern of calcification around the odontoblastic processes forms the dentinal tubules, and the dentin between these tubules is called intertubular dentin."
                }
            },
            "Odontoblastic Processes": {
                "card_content": {
                    "img": "./src/assets/Zones_of_Pulp/Sub_Categories/Banner/Odontoblastic_Process.png",
                    "title": "Odontoblastic Zone: Odontoblastic Process",
                    "content": "The odontoblastic processes, also referred to as Tomes' processes, are housed within the dentinal tubules. The extent of the odontoblastic processes in dentin has not been determined. During the early stages of tooth development, the processes extend into the entire thickness of the dentin. Studies in adult teeth have given conflicting information on the extent of the processes. Some studies claim that these processes extend into one-third of the thickness of the dentin (0.7 mm), whereas others claim that the processes extend through the thickness of the dentin and reach the Dentinoenamel junction. The space around the odontoblastic processes, the periodontoblastic space, and the space peripheral to the end of the odontoblastic processes are filled with extracellular fluid. This fluid originates from the capillary transudate and plays an important role in sensory transmission. <br><br> <strong> Clinical Note </strong> The unmyelinated nerves for sensory perception are also found in the pulpal end of the periodontoblastic space of the dentinal tubules."
                }
            },
            "Incremental Lines": {
                "card_content": {
                    "img": "./src/assets/Zones_of_Pulp/Sub_Categories/Banner/Incremental_Lines.png",
                    "title": "Odontoblastic Zone: Incremental Lines",
                    "content": "During dentinogenesis, there are periods of activity and periods of rest. These periods are demarcated by the presence of lines, called incremental lines. These lines are accentuated during periods of illness, by deficiencies in nutrition, and at birth. The accentuated incremental line that occurs at birth is called the neonatal line. In some areas in the mature dentin, the matrix has not calcified or is hypocalcified. These areas are called interglobular dentin. One also sees spaces in the root dentin near the cementodentinal junction called the granular layer of Tomes.<img class='image-center' src='./src/assets/Zones_of_Pulp/Sub_Categories/Incremental_Lines.jpg' alt='Image-1'> <br><br> <strong> Clinical Note </strong> The incremental lines represent rest periods in dentinogenesis, whereas the interglobular dentin and the granular layer of Tomes probably represent a defect in matrix formation."
                }
            },
            "Dentinal Tubules": {
                "card_content": {
                    "img": "./src/assets/Zones_of_Pulp/Sub_Categories/Banner/Dentinal_Tubules.png",
                    "title": "Odontoblastic Zone: Dentinal Tubules",
                    "content": "The dentinal tubules extend from the predentin border to the dentinoenamel and the dentinocemental junctions. They are conical in shape, with a 2.5 μm mean diameter in the pulpal wall and a 0.9 μm mean diameter in the dentinoenamel or dentinocemental junctions because of the deposition of the peritubular dentin. <br><br> <img class='image-center' src='./src/assets/Zones_of_Pulp/Sub_Categories/Dentinal_Tubules_1.jpg' alt='Image-1'> <span>Peritubular dentin, dentinal tubules, highly mineralized dentin: dentinal tubules containing highly mineralized dentin. The section is made halfway through the dentin (scanning electron microscopy [SEM]). (Courtesy: Randi F. Klinge, University of Oslo, Norway.)</span> As the dentinal tubules approach the dentinoenamel junction, they branch and increase the ratio per unit area over that of the middle third of the dentin. The branching of the dentinal tubules occurs during the beginning of dentinogenesis. Each preodontoblast sends various cytoplasmic processes into the acellular zone and thereby produces several future dentinal tubules.<br><br>As the fully mature odontoblast migrates pulpally, the processes unite to form a single dentinal tubule with terminal branches at the dentinoenamel junction. This branching may explain the extreme sensitivity of the Dentinoenamel junction. Because the peritubular dentin has an organic matrix with fewer collagen fibers than the intertubular dentin, it is more mineralized and harder.<br><br>As the pulp ages, the continuous deposition of peritubular dentin may obliterate the dentinal tubules peripherally. This obliteration of tubules results in the formation of the sclerotic dentin, which has a glassy appearance under transmitted light. <br><br>  <img class='image-center' src='./src/assets/Zones_of_Pulp/Sub_Categories/Dentinal_Tubules_3.png' alt='Image-1'> <br><br> <img class='image-center' src='./src/assets/Zones_of_Pulp/Sub_Categories/Dentinal_Tubules_2.jpg' alt='Image-1'> <br><br>  <strong> Clinical Note </strong> Sclerosis reduces the permeability of the dentin and may serve as a pulp-protective mechanism. A mild stimulus of short duration may accelerate the production of the peritubular dentin, may produce sclerosis peripherally, and may thus reduce the permeability of dentin and enhance pulp protection. <br><br> By dentinogenesis, the odontoblasts are involved in the formation of the teeth and the protection of the pulp from noxious stimuli. To fulfill the formative and protective functions of the pulp, the odontoblasts deposit primary, secondary, and tertiary dentin."
                }
            },
            "Primary Dentin": {
                "card_content": {
                    "img": "./src/assets/Zones_of_Pulp/Sub_Categories/Banner/Primary_Dentin.jpg",
                    "title": "Odontoblastic Zone: Primary Dentin",
                    "content": "Primary dentin is elaborated before the teeth erupt and is divided into mantle and circumpulpal dentin. Mantle dentin, the first calcified layer of the dentin deposited against the enamel, forms the dentinal side of the dentinoenamel junction. <br><br> Circumpulpal dentin is the dentin formed after the layer of mantle dentin. Primary dentin fulfils the initial formative function of the pulp. <br><br><img class='image-center' src='./src/assets/Zones_of_Pulp/Sub_Categories/Primary_Dentin.jpg' alt='Image-1'>"
                }
            },
            "Secondary Dentin": {
                "card_content": {
                    "img": "./src/assets/Zones_of_Pulp/Sub_Categories/Banner/Secondary_Dentin.jpg",
                    "title": "Odontoblastic Zone: Secondary Dentin",
                    "content": "Secondary dentin is elaborated after eruption of the teeth. It can be differentiated from primary dentin by the sharp bending of the tubules producing a line of demarcation. It is deposited unevenly on primary dentin at a low rate and has incremental patterns and tubular structures less regular than those of primary dentin. For example, secondary dentin is deposited in greater quantities in the floor and roof of the pulp chamber than on the walls. This uneven deposition explains the pattern of reduction of the pulp chamber and pulp horns as teeth age. This deposition of secondary dentin protects the pulp.<br><br> <img class='image-center' src='./src/assets/Zones_of_Pulp/Sub_Categories/Secondary_Dentin.jpg' alt='Image-1'>"
                }
            },
            "Tertiary Dentin": {
                "card_content": {
                    "img": "./src/assets/Zones_of_Pulp/Sub_Categories/Banner/Tertiary_Dentin.jpg",
                    "title": "Odontoblastic Zone: Tertiary Dentin",
                    "content": "Two types of tertiary dentin are recognized:<br><br>1. Tertiary dentin formed by primary odontoblasts following a mild stimulus is called reactionary dentin.<br><br>2. Tertiary dentin formed by newly differentiated or secondary odontoblasts is termed reparative dentin.<br><br><img class='image-center' src='./src/assets/Zones_of_Pulp/Sub_Categories/Tertiary_Dentin_1.jpg' alt='Image-1'><span>Schematic representation of a tooth indicating the regenerative capacity of the dentine-pulp complex upon a carious lesion. Reactionary dentine is deposited by odontoblasts in response to a mild insult(e.g., dentine injury by minor caries, without pulp tissue exposure), potentially including proinflammatory mediators. These molecules are in charge to activate the immune response against the pathogens. Reparative dentinogenesis is a more complex mechanism and requires the generation of new odontoblast-like cells from stem/progenitor pulp in response to a severe insult.</span> <br> <strong> Clinical Note </strong> • Reparative dentin, also known as irregular or tertiary dentin, is elaborated by the pulp as a protective response to noxious stimuli. <br><br> • These stimuli can result from caries, operative procedures, restorative materials, abrasion, erosion, or trauma. <br><br> • The reparative dentin is deposited in the affected area at an increased rate that averages 1.5 gm per day. <br><br> • The rate, quality, and quantity of reparative dentin deposited depend on the severity and duration of the injury to the odontoblasts and are usually produced by 'replacement' odontoblasts. <br><br>  When a mild stimulus is applied to the odontoblasts for a prolonged period of time, such as abrasion, reparative dentin may be deposited at a slower rate. This tissue is characterized by slightly irregular tubules. On the other hand, an aggressive carious lesion or other abrupt stimulus stimulates the  of reparative dentin with fewer and more irregular tubules. If the odontoblast is injured beyond repair, the egenerated odontoblasts will leave empty tubules, called dead tracts, which allow bacteria and noxious products to enter the pulp.<br><br><img class='image-center' src='./src/assets/Zones_of_Pulp/Sub_Categories/Tertiary_Dentin_2.jpg' alt='Image-1'><br><img class='image-center' src='./src/assets/Zones_of_Pulp/Sub_Categories/Tertiary_Dentin_3.jpg' alt='Image-1'> <span>Dead Tracts- Note the enamel layer (A) on the tip of the cusp has been worn down close to the dentin. The dentinal tubules under this region of trauma appear black . Trauma will cause the odontoblastic processes within the dentinal tubules to 'die back' toward the cell body. In severe cases the cells themselves may die. Such regions of dentin (with empty dentinal tubules) are called dead tracts (B) and appear dark in ground sections. They are difficult to detect in demineralized sections. The odontoblasts whose processes had occupied the dentinal tubules have responded by forming a protective layer of secondary (or reactive) dentin (C).</span> Reparative dentin is deposited on the pulpal wall of a dead tract unless the pulp is too atrophic. Because reparative dentin has fewer tubules, although it is less mineralized, it blocks the ingress of noxious products into the pulp. As the caries progress and as more odontoblasts are injured beyond repair, the layers of reparative dentin become more atubular and may have cell inclusions, i.e., trapped odontoblasts. The cellular inclusions are uncommon in human teeth. On removal of the caries, the mesenchymal cells of the cell-rich zone differentiate into odontoblasts to replace those that have necrosed. These newly formed odontoblasts can produce well-organized dentin or an amorphous, poorly calcified, permeable dentin. The demarcation zone between secondary and reparative dentin is called the calciotraumatic line.<br><img class='image-center' src='./src/assets/Zones_of_Pulp/Sub_Categories/Tertiary_Dentin_4.jpg' alt='Image-1'><span>Beneath a calciotraumatic line reactionary dentin is formed as a response to a carious lesion.</span>"
                }
            },
            "Ground Substance": {
                "card_content": {
                    "img": "./src/assets/Zones_of_Pulp/Sub_Categories/Banner/Ground_Substance.jpg",
                    "title": "Cell Rich Zone: Ground Substance",
                    "content": "Ground substance, the main constituent of the pulp, is the part of the matrix that surrounds and supports the cellular and vascular elements of the pulp. It is a gelatinous substance composed of proteoglycans, glycoproteins, and water. <br><br> Ground substance serves as a transport medium for metabolites and waste products of cells and as a barrier against the spread of bacteria. Age and disease may change the composition and function of the ground substance."
                }
            },
            "Fibroblasts": {
                "card_content": {
                    "img": "./src/assets/Zones_of_Pulp/Sub_Categories/Banner/Fibroblasts.png",
                    "title": "Cell Rich Zone: Fibroblasts",
                    "content": "The fibroblasts are the predominant cells of the pulp. They may originate from undifferentiated mesenchymal cells of the pulp or from the division of existing fibroblasts. The fibroblasts are stellate in shape, with ovoid nuclei and cytoplasmic processes. As they age, they become rounder, with round nuclei and short cytoplasmic processes. Although fibroblasts are present in the cell-free and central zones of the pulp, they are concentrated in the cell-rich zone, especially in the coronal portion.<br><br>The function of the fibroblasts is elaboration of ground substance and collagen fibers, which constitute the matrix of the pulp. The fibroblasts are also involved in the degradation of collagen and the deposition of calcified tissue. They can elaborate denticles and can differentiate to replace dead odontoblasts, with the potential for reparative dentin formation.<br><br>Compared to the coronal third, the apical third of the mature pulp contains more collagen fibers and is therefore more fibrous and has a whitish coloration. This fibrous characteristic of the apical third protects the neurovascular bundle from injury and is of clinical significance because it facilitates the removal of the pulp during pulpectomy.<br><br>Because of the reduction of the pulp space through the continuous deposition of secondary dentin and because of the increased deposition of collagen, the pulp becomes more fibrous with age. Concomitantly, one sees a decrease in cellular elements and a reduction in the reparative potential of the pulp."
                }
            },
            "Undifferentiated Mesenchymal Cells": {
                "card_content": {
                    "img": "./src/assets/Zones_of_Pulp/Sub_Categories/Banner/Undifferentiated_Mesenchymal_Cells.jpg",
                    "title": "Cell Rich Zone: Undifferentiated Mesenchymal Cells",
                    "content": "The undifferentiated mesenchymal cells are derived from the mesenchymal cells of the dental papilla. Because of their function in repair and regeneration, they retain pluripotential characteristics and can differentiate into fibroblasts, odontoblasts, macrophages, or osteoclasts. They resemble fibroblasts as they are stellate in shape, with a large nucleus and little cytoplasm. These cells, if present, are usually located around blood vessels in the cell-rich zone and are difficult to recognize."
                }
            },
            "Macrophages, Lymphocytes, and Plasma Cells": {
                "card_content": {
                    "img": "./src/assets/Zones_of_Pulp/Sub_Categories/Banner/Macrophages_Lymphocytes_and_Plasma_Cells.jpg",
                    "title": "Cell Rich Zone: Macrophages, Lymphocytes, and Plasma Cells",
                    "content": "Macrophages are found in the cell-rich zone, especially near the blood vessels. These cells are blood monocytes that have migrated into the pulp tissue. Their function is to phagocytize necrotic debris and foreign materials. Lymphocytes and plasma cells, if present in the normal pulp, are found in the coronal subodontoblastic region. The function of these cells in the normal pulp may be immune surveillance."
                }
            },
            "Blood Vessels of Pulp": {
                "card_content": {
                    "img": "./src/assets/Zones_of_Pulp/Sub_Categories/Banner/Blood_Vessels.png",
                    "title": "Central Zone: Blood Vessels of Pulp",
                    "content": "The neurovascular bundle enters the pulp through the apical foramina. It consists of one or two arterioles with their sympathetic nerve fibers and myelinated and unmyelinated sensory nerves entering the pulp, and two or three venules and lymphatic vessels exiting the pulp. In some teeth, accessory foramina may serve as portals of entry and exit for blood vessels only.<br><img class='image-center' src='./src/assets/Zones_of_Pulp/Sub_Categories/Blood_Vessels.jpg' alt='Image-1'><span>Schematic presentation of the intradental innervation. The nerve bundles enter the pulp via the apical foramen/foramina and branch extensively especially in the coronal pulp. The pulp-dentin border zone in the peripheral pulp (pulp tips) is the most densely innervated area, where the nerve endings also extend the longest distance (100 - 150 um) into the dentinal tubules.</span> The pulpal blood flow mainly determines the speed of diffusion between the blood and the interstitial fluid; the higher the blood flow, the faster the diffusion. Regulation of an adequate blood flow is a crucial point for survival and normal function in any tissue.<br><br>i. Afferent circulation of the pulp consists of the arterioles entering the apical foramen. As these vessels traverse the center of the pulp, they branch into terminal arterioles, metarterioles, precapillaries, and finally capillaries. The capillaries end in the cell-poor zone and form a rich subodontoblastic plexus.<br><br>ii. Efferent circulation consists of postcapillary venules and collecting venules, which empty into two or three venules that exit through the apical foramina and empty into the vessels in the PDL. Lymphatic vessels follow this same pattern.<br>The function of blood vessels is to transport nutrients, fluids, and oxygen to the tissues and to remove metabolic waste from the tissues by maintaining an adequate flow of blood through the capillaries. This metabolic exchange occurs in the capillary bed.<br><br>The transfer of nutrients and metabolic waste through the capillary walls is controlled by the laws of hydrostatics and osmosis. The walls of the capillaries are an average of 0.5 μm thickness and serve as a permeable membrane that permits the exchange of fluids. The absorption of metabolic wastes and fluids prevents their accumulation in the pulpal tissues and also precludes increases in the pulpal tissue pressure. <br><br> <strong> Clinical Note </strong> In areas of pulpal injury, the permeability of the capillary walls permits the seepage of blood proteins into the pulpal tissues and increases the osmotic pressure of tissues of the area. This increase in osmotic pressure attracts more fluid to the area; the result is the stagnation of fluid   known as edema. <br><br> <strong>Citation</strong> BERGGREEN, E., BLETSA, A., & HEYERAAS, K. J. (2007). Circulation in normal and inflamed dental pulp. Endodontic Topics, 17(1), 2-11. <br> <a target='_blank' href='https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1601-1546.2010.00249.x'>https://onlinelibrary.wiley.com/doi/abs/10.1111/j.1601-1546.2010.00249.x</a> <br>"
                }
            },
            "Lymphatic Drainage": {
                "card_content": {
                    "img": "./src/assets/Zones_of_Pulp/Sub_Categories/Banner/Lymphatic_Drainage.png",
                    "title": "Central Zone: Lymphatic Drainage",
                    "content": "Lymphatic vessels are present in the pulp. The function of these vessels is the removal of interstitial fluid and metabolic waste products to maintain the intrapulpal tissue pressure at a normal level. These lymphatic vessels follow the course of the venules toward the apical foramen.<br><br><strong>Interstitial Fluid</strong>Interstitial fluid bathes all the pulpal tissues and fills the dentinal tubules in their distal extension and around the odontoblastic processes. The interstitial fluid that fills the dentinal tubules is called the dentinal fluid. As previously discussed, the encasement of the pulp in dentin produces a limited environment permitting only a small amount of interstitial fluid.<br><br><strong>Tissue Fluid Pressure</strong>The hydrostatic pressure in the interstitial fluid surrounding the pulpal cells is called the pulpal tissue fluid pressure. <br><br> <strong> Clinical Note </strong> • The presence of fluid in the pulpal cavity produces an average intrapulpal tissue pressure of approximately <b>10 mm Hg.</b> <br><br> • A small increase in intrapulpal pressure to <b>13 mm Hg</b> during inflammatory changes causes reversible changes in the pulp, but if intrapulpal pressure increases to <b>35 mm Hg</b>, it produces irreversible changes. <br><br> • Owing to the structural makeup of the matrix, in which the ground substance is reinforced by collagen fibers, the pulp seems to be able to limit the area of increased intrapulpal pressure during periods of inflammation. <br><br> <strong>Citation</strong> Wiśniewska K, Rybak Z, Szymonowicz M, Kuropka P, Dobrzyński M. Review on the Lymphatic Vessels in the Dental Pulp. Biology (Basel). 2021 Dec 2;10(12):1257. <br> <a target='_blank' href='https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8698795/'>https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8698795/</a>"
                }
            },
            "Innervation": {
                "card_content": {
                    "img": "./src/assets/Zones_of_Pulp/Sub_Categories/Banner/Innervation.png",
                    "title": "Central Zone: Innervation",
                    "content": "The sensory mechanism of the pulp is composed of sensory afferent and autonomic efferent systems.<br><ul><li>The afferent system conducts impulses perceived by the pulp from a variety of stimuli to the cortex of the brain, where they are interpreted as pain, regardless of the stimulus.</li><br><li>The efferent motor pathway in the dental pulp consists of sympathetic fibers from the cervical ganglion that enter through the apical foramina in the outer layer of the arterioles, the tunica adventitia. The sympathetic nerves provide vasomotor control to circulation and therefore regulate the blood flow and intrapulpal blood pressure in response to stimuli. Approximately 80% of the nerves of the pulp are <strong>C fibers</strong> and the rest are <strong>Aδ fibers (Table 1.1).</strong></li></ul><br><br><img class='image-center' src='./src/assets/Zones_of_Pulp/Sub_Categories/Innervation_of_Pulp_1.jpg' alt='Image-1'><br> <img class='image-center' src='./src/assets/Zones_of_Pulp/Sub_Categories/Innervation_of_Pulp_2.jpg' alt='Image-1'><span> Distribution of intradental A- and C-fibers. Unmyelinated C-fibers are located in the pulp proper, whereas myelinated A-fibers are extensively distributed in the pulp dentin border, penetrating the inner part of dentin.</span> <br><strong> Clinical Note </strong> The hydrodynamic theory explains the painful reaction of the pulp to heat, cold, cutting of the dentin, and probing of the dentin. <br><br> • Heat expands the dentinal fluid <br><br> • Cold contracts the dentinal fluid <br><br> • Cutting the dentinal tubules allows the dentinal fluid to escape <br><br> • Probing the cut or exposed dentinal surface may deform the tubules and produce fluid movement. <br><br> <strong>Citation</strong> Närhi M. The neurophysiology of the teeth. Dent Clin North Am. 1990;34(3):439-448. <br> <a target='_blank' href='https://doi.org/10.1016/S0011-8532(22)01127-2'>https://doi.org/10.1016/S0011-8532(22)01127-2 </a> "
                }
            }
        }
    },

    "Classification": {
        "img": "./src/assets/Classification/Classification.jpg",
        "card_content": {
            "title": "Classification",
            "content": "The clinical classification of pulpal diseases is based primarily on symptoms. No correlation exists between histopathologic findings and the existing symptoms. The value of the clinical classification lies in its use by the clinician to determine the appropriate care and treatment, the endodontic prognosis, and probably the restorative needs of the tooth. <br><br> The demarcation between irritation of the pulp leading to productive stimulation of secondary dentin formation and that leading to pulpitis is indistinct.  <br><br> <img class='image-center' src='./src/assets/Classification/Classification_1.png' alt='Image-1'> <br> <strong>Clinical Note</strong>The reaction of the pulp depends not only on the degree of irritation but also on the individual makeup and resistance of the pulp tissue to injury. In one case, a slight degree of irritation produces a symptomless productive reaction of the pulp, in another it produces hyperemia, and in still another, acute pulpitis may result. <br><br> <strong>Citations</strong>1. Singh, G., Paul R, S., Arora, A., Kumar, S., Jindal, L., & Raina, S. (2020). Disease of Pulp and Periradicular Tissue: An Overview. Journal of Current Medical Research and Opinion, 3(10). <br> <a target='_blank' href='https://www.researchgate.net/publication/346244739_Disease_of_Pulp_and_Periradicular_Tissue_An_Overview'>https://www.researchgate.net/publication/346244739_Disease_of_Pulp_and_Periradicular_Tissue_An_Overview</a> <br> 2. Abbott, P., & Yu, C. (2007). A clinical classification of the status of the pulp and the root canal system. Australian Dental Journal, 52, S17-S31. <br> <a target='_blank' href='https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1834-7819.2007.tb00522.x'>https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1834-7819.2007.tb00522.x</a>"
        },
        "categories": {
            "Inflammatory Disease": {
                "card_content": {
                    "img": "./src/assets/Classification/Categories/Banner/Inflammatory_Disease.png",
                    "title": "Classification: Inflammatory Disease",
                    "content": "Pulpitis or inflammation of the pulp may be reversible or irreversible, symptomatic (acute) or asymptomatic (chronic), partial or total, and the pulp may be infected or sterile. The extent of inflammation, whether partial or total, cannot be determined histologically, and the bacteriologic state, whether the tissue is infected or sterile, cannot be determined except by smear or culture. The only clinical differentiation possible in pulpitis is between the symptomatic and asymptomatic stages of the disease.<br><br>The sequelae of the various diseases of the pulp are depicted in the flowchart below:<br><br> <img class='image-center' src='./src/assets/Classification/Categories/Inflammatory_Disease.png' alt='Image-1'> <br><br> <strong>Citations</strong>1. Singh, G., Paul R, S., Arora, A., Kumar, S., Jindal, L., & Raina, S. (2020). Disease of Pulp and Periradicular Tissue: An Overview. Journal of Current Medical Research and Opinion, 3(10). <br> <a target='_blank' href='https://www.researchgate.net/publication/346244739_Disease_of_Pulp_and_Periradicular_Tissue_An_Overview'>https://www.researchgate.net/publication/346244739_Disease_of_Pulp_and_Periradicular_Tissue_An_Overview</a> <br> 2. Abbott, P., & Yu, C. (2007). A clinical classification of the status of the pulp and the root canal system. Australian Dental Journal, 52, S17-S31. <br> <a target='_blank' href='https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1834-7819.2007.tb00522.x'>https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1834-7819.2007.tb00522.x</a>"
                },
                "sub_categories": [
                    "Reversible Pulpitis",
                    "Irreversible Pulpitis"
                ]
            },
            "Pulp Necrosis": {
                "card_content": {
                    "img": "./src/assets/Classification/Categories/Banner/Pulp_Necrosis.png",
                    "title": "Classification: Pulp Necrosis",
                    "content": "Necrosis is the death of the pulp. It may be partial or total, depending on whether part of or the entire pulp is involved. Necrosis, although a sequel to inflammation, can also occur following a traumatic injury in which the pulp is destroyed before an inflammatory reaction takes place. As a result, an ischemic infarction can develop and may cause a dry gangrenous necrotic pulp. <br><br> <strong>Types</strong> <br> <strong> A. Pulp necrobiosis:</strong> A tooth with necrobiosis has both inflamed (acute irreversible pulpitis) and necrotic (usually infected) pulp tissue. Grossman suggested the term “necrobiosis” because it accurately indicates the condition with “necro-” indicating necrosis and “-bio-” indicating the presence of vital tissue. The pulp sensibility tests usually do not correlate with the patient's symptoms. <br><br> The key diagnostic feature would be that the patient would report with mixed symptoms (i.e., symptoms of pulpitis and an infected root canal system at the same time). <br><br> <strong>B. Pulp necrosis with no signs of infection: </strong> In cases of necrosis without infection, there will be no periapical tissue response. Hence, there will be no apical periodontitis The key diagnostic feature would be that there would be no symptoms, no response to pulp sensibility tests, and no other abnormal findings. <br><br> <strong>C. Necrotic and infected pulp:</strong> When a pulp necroses as a result of bacterial invasion of the tooth, it will become infected over time. The patient would report with no pulp-related symptoms (i.e., no thermal sensitivity) may be no symptoms at all; any symptoms will be from the periapical tissues—hence, symptoms depend on the periapical status. <br><br>The key diagnostic feature would be that there would be no response to pulp sensibility tests and there will be a periapical radiolucency. <br><br> <strong>Cause</strong> Necrosis of the pulp can be caused by any noxious insult injurious to the pulp, such as bacteria, trauma, and chemical irritation. <br><br><strong>Symptoms</strong>An otherwise normal tooth with a necrotic pulp causes no painful symptoms. Frequently, discoloration of the tooth is the first indication that the pulp is dead. The dull or opaque appearance of the crown may be merely due to a lack of normal translucency. At other times, however, the tooth may have a definite grayish or brownish discoloration and may lack its usual brilliance and luster. The presence of a necrotic pulp may be discovered only by chance because such a tooth is asymptomatic, and the radiograph is nondiagnostic. Teeth with partial necrosis can respond to thermal changes, owing to the presence of vital nerve fibers passing through the adjacent inflamed tissue. <br><br> <strong>Diagnosis</strong>Radiographs generally show a large cavity or filling, an open approach to the root canal, and a thickening of the periodontal ligament. Some teeth have neither a cavity nor a filling, and the pulp has died as a result of trauma. A few patients have a history of severe pain lasting from a few minutes to a few hours, followed by complete and sudden cessation of pain. In other cases, the patient is unaware that the pulp has died slowly and silently, without causing symptoms. <br><br> A tooth with a necrotic pulp does not respond to cold, the electric pulp test, or the test cavity. In rare cases, however, a minimal response to the maximum current of an electric pulp tester occurs when the electric current is conducted through the moisture present in a root canal following liquefaction necrosis to neighboring vital tissue. In other patients, a few apical nerve fibers survive and respond similarly. Nerve fibers are resistant to inflammatory changes. A correlation of cold and electric tests and a history of pain, in conjunction with a thorough clinical examination, should establish a correct diagnosis. <br><br> <strong>Treatment</strong>Treatment consists of complete removal of pulp (pulpectomy) and obturation of the root canals.<br><br> <strong>Histopathology</strong> Histopathologically, necrosis is of two general types: <br><br> 1. Coagulation necrosis results in the soluble portion of the tissue being precipitated or converted into a solid material. <br><br> • Caseation necrosis is a form of coagulation necrosis in which the tissue is converted into a cheesy mass consisting chiefly of coagulated proteins, fats, and water. <br><br> 2. Liquefaction necrosis results when proteolytic enzymes convert the tissue into a softened mass, a liquid, or amorphous debris. The end products of pulp decomposition are those of protein decomposition, namely, hydrogen sulfide, ammonia, fatty substances, indican, ptomaines, water, and carbon dioxide. The intermediate products, such as indole, skatole, putrescine, and cadaverine, contribute to the unpleasant odor sometimes emanating from a root canal. <br><br> Necrotic pulp tissue, cellular debris, and microorganisms may be seen in the pulp cavity. The periapical tissue may be normal or slight evidence of inflammation of the apical periodontal ligament may be present. <br><br> <strong>Prognosis</strong>The prognosis for the tooth is favorable if proper endodontic therapy is instituted. <br><br> <strong>Citation</strong> <a target='_blank' href='https://www.aae.org/specialty/wp-content/uploads/sites/2/2017/07/endodonticdiagnosisfall2013.pdf'>https://www.aae.org/specialty/wp-content/uploads/sites/2/2017/07/endodonticdiagnosisfall2013.pdf</a>"
                },
                "sub_categories": []
            },
            "Pulp Degeneration": {
                "card_content": {
                    "img": "./src/assets/Classification/Categories/Banner/Pulp_Degeneration.jpg",
                    "title": "Classification: Pulp Degeneration",
                    "content": "Pulp degeneration is generally present in the teeth of older people. It may also be the result of persistent, mild irritation in teeth of younger people, as in calcific degeneration of the pulp. It is not necessarily related to infection or caries, although a cavity or filling may be present in the affected tooth. The early stage of pulp degeneration does not usually cause definite clinical symptoms.<br><br>The tooth is not discolored, and the pulp may react normally to electric and thermal tests. As degeneration of the pulp progresses, the tooth may become discolored, and the pulp will not respond to stimulation. The specific types of pulp degeneration are discussed in the following text."
                },
                "sub_categories": [
                    "Calcific Degeneration",
                    "Fibrous Degeneration"
                ]
            }
        },
        "sub_categories": {
            "Reversible Pulpitis": {
                "card_content": {
                    "img": "./src/assets/Classification/Sub_Categories/Banner/Reversible_Pulpitis.jpg",
                    "title": "Inflammatory Disease: Reversible Pulpitis",
                    "content": "<strong>Definition:</strong> Reversible pulpitis is a mild-to-moderate inflammatory condition of the pulp caused by noxious stimuli in which the pulp is capable of returning to the uninflamed state following removal of the stimuli.<br><br><strong>Types</strong>• Acute reversible pulpitis: The pain has been present for a short time (e.g., a few hours or days); however, it immediately ceases on removal of the aggravating stimuli.<br><br>• Chronic reversible pulpitis: The pain has been present for a long time (e.g., months); however, it immediately ceases on removal of the aggravating stimuli.<br><br><strong>Cause</strong>Reversible pulpitis may be caused by any agent that is capable of injuring the pulp. Specifically, the cause may be any of the following:<br><br>• Trauma, as from a blow or from a disturbed occlusal relationship<br><br>• Thermal shock, as from preparing a cavity with a dull bur or keeping the bur in contact with the tooth for too long, or as from overheating during polishing a filling.<br><br>• Excessive dehydration of a cavity or irritation of exposed dentin at the neck of a tooth.<br><br>• Placement of a fresh amalgam filling in contact with, or occluding, a cast restoration.<br><br>• Chemical stimulus, as from sweet or sour foodstuffs or from irritation of a filling; or bacteria, as from caries. <br><br>Following insertion of a restoration, patients often complain of mild sensitivity to temperature changes, especially cold. Such sensitivity may last 2-3 days or a week, or even longer, but it gradually subsides. This sensitivity is symptomatic of reversible pulpitis. <br><br>Local vascular congestion associated with common cold or with sinus disease can cause a generalized transient hyperaemia of the pulp of the maxillary posterior teeth. The irritant that causes hyperaemia or mild inflammation in one pulp may produce secondary dentin in another if the irritant is mild enough or if the pulp is vigorous enough to protect itself. <br><br><strong>Symptoms</strong>• Symptomatic reversible pulpitis is characterized by short, sharp pain lasting for a moment. <br><br>• This pain is always specific to a stimulus. <br><br>• The pain is instantly relieved on removal of the stimulus.<br><br>• It is more often brought on by cold than by hot food or beverages and by cold air. It does not occur spontaneously and does not continue when the cause has been removed. <br><br>The clinical difference between reversible and irreversible pulpitis is quantitative; the pain of irreversible pulpitis is more severe and lasts longer. In reversible pulpitis, the cause of the pain is generally traceable to a stimulus, such as cold water or a draft of air, whereas in irreversible pulpitis, the pain may come without any apparent stimulus. <br><br><strong>Diagnosis</strong>Diagnosis is by a study of the patient's symptoms and by clinical tests. The pain is sharp, lasts but a few seconds, and generally disappears when the stimulus is removed. Cold, sweet, or sour usually causes it. Pain may become chronic. <br><br>Although each paroxysm may be of short duration, the paroxysms may continue for weeks or even months. The pulp may recover completely, or the pain may last longer each time, and intervals of relief may become shorter, until the pulp finally succumbs. Because the pulp is sensitive to temperature changes, particularly cold, application of cold is an excellent method of locating and diagnosing the involved tooth. A tooth with reversible pulpitis reacts normally to percussion, palpation, and mobility, and the periapical tissue is normal on radiographic examination.<br><br><strong>Differential Diagnosis</strong>In reversible pulpitis, the pain is generally transitory, lasting a matter of seconds, whereas in irreversible pulpitis, the pain may last several minutes or longer. The patien's description of the pain, particularly regarding its onset, character, and duration, is often of inestimable help in arriving at a correct differential diagnosis. Thermal tests are useful in locating the affected tooth if unknown. The electric pulp test, using less current than on a control tooth, is an excellent corroborating test.<br><br><strong>Treatment</strong>The best treatment for reversible pulpitis is prevention. Periodic care to prevent the development of caries, early insertion of a filling if a cavity has developed, desensitization of the necks of teeth where gingival recession is marked, use of a cavity varnish or cement base before insertion of a filling, and care in tooth preparation and polishing are recommended to prevent pulpitis.<br><br> When reversible pulpitis is present, removal of the noxious stimuli will usually bring the pulp back to a healthy state. <br><br>Once the symptoms have subsided, the tooth should be tested for vitality to make sure that pulpal necrosis has not occurred. When pain persists despite proper treatment, the pulpal inflammation should be regarded as irreversible, the treatment for which is pulp extirpation.<br><br> <strong>Prognosis</strong> The prognosis for the pulp is favorable if the irritant is removed early enough; otherwise, the condition may develop into irreversible pulpitis. <br><br> <strong>Citation</strong>Dabuleanu M. Pulpitis (reversible/irreversible). J Can Dent Assoc. 2013;79:d90. PMID: 24059490. <br> <a target='_blank' href='https://jcda.ca/article/d90'>https://jcda.ca/article/d90</a>"
                }
            },
            "Irreversible Pulpitis": {
                "card_content": {
                    "img": "./src/assets/Classification/Sub_Categories/Banner/Irreversible_Pulpitis.png",
                    "title": "Inflammatory Disease: Irreversible Pulpitis",
                    "content": "<strong>Definition:</strong> Irreversible pulpitis is a persistent inflammatory condition of the pulp, symptomatic or asymptomatic in nature with the pulp becoming incapable of healing.<br><br><strong>Types</strong>• Asymptomatic irreversible pulpitis<br><br>• Symptomatic irreversible pulpitis<br><br><strong>Cause</strong>The most common cause of irreversible pulpitis is bacterial involvement of the pulp through caries, although any clinical factor, chemical, thermal, or mechanical, already mentioned as a cause of pulp disease, may also cause pulpitis. As previously stated, reversible pulpitis may deteriorate into irreversible pulpitis.<br><br><strong>Symptoms</strong>• In the early stages of irreversible pulpitis, a paroxysm of pain may be caused by the following: sudden temperature changes, particularly cold; sweet or acid foodstuffs; and pressure from packing food into a cavity or suction exerted by the tongue or cheek.<br><br>• Symptomatic irreversible pulpitis exhibits pain usually caused by a hot or cold stimulus, or pain that occurs spontaneously. The pain persists for several minutes to hours, lingering after removal of the thermal stimulus.<br><br>• The pain often continues when the cause has been removed, and it may come and go spontaneously, without an apparent cause. <br><br>• The patient may describe the pain as sharp, piercing, or shooting, and it is generally severe.<br><br>• It may be intermittent or continuous, depending on the degree of pulpal involvement and on whether it is related to an external stimulus.<br><br>• The patient may also complain of postural pain, i.e., change of position (bending over or lying down) exacerbates the pain. This is due to the increase in intrapulpal pressure when the patient changes position from a standing posture to a supine (lying down) posture.<br><br>• The patient may also have pain referred to adjacent teeth, to the temple or sinuses when an upper posterior tooth is involved, or to the ear when a lower posterior tooth is affected.<br><br>• In later stages, the pain is more severe and is generally described as boring, gnawing, or throbbing, or as if the tooth was under constant pressure. The pulp need not be macroscopically exposed, but a slight exposure is generally present, or else the pulp is covered with a layer of soft, leathery decay. When no outlet is present, whether because of a covering of decay or a filling or because of food packed into a small exposure in the dentin, pain can be most intense.<br><br>• Patients are often kept awake at night by the pain (nocturnal pain), which continues to be intolerable despite all their efforts at analgesia. Pain is increased by heat and is sometimes relieved by cold, although continued cold may intensify the pain. After exposure and drainage of the pulp, pain may be slight, manifesting itself as a dull consciousness, or may be entirely absent. Pain can return if food packs into the cavity or underneath a leaky filling; it may not be as intense because of degeneration of the superficial nerve fibers.<br><br>• Apical periodontitis is absent, except in the later stages, when inflammation or infection extends to the periodontal ligament.<br><br><strong>Diagnosis</strong>Inspection generally discloses a deep cavity extending to the pulp or decay under a filling. The pulp may already be exposed. On gaining access to the exposure, one may see a greyish, scum-like layer over the exposed pulp and the surrounding dentin. This layer is composed of food debris, degenerated polymorphonuclear leukocytes, microorganisms, and blood cells. The surface of the pulp is eroded. An odor of decomposition is frequently present in this area. <br><br><img class='image-center' src='./src/assets/Classification/Sub_Categories/Irreversible_Pulpitis.png' alt='Image-1'> <br> Probing into the area is not painful to the patient until the deeper areas of the pulp are reached. At this level, both pain and haemorrhage may occur. If the pulp is not exposed by the carious process, a drop of pus may be expressed when one gains access to the pulp chamber. Radiographic examination may disclose an interproximal cavity not seen visually or may suggest involvement of a pulp horn. <br><br> <img class='image-center' src='./src/assets/Classification/Sub_Categories/Irreversible_Pulpitis_1.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Classification/Sub_Categories/Irreversible_Pulpitis_2.jpg' alt='Image-1'> <br> A radiograph may also show exposure of the pulp, caries under a filling, or a deep cavity or filling threatening the integrity of the pulp. In the early stages of irreversible pulpitis, the thermal test may elicit pain that persists after removal of the thermal stimulus. <br><br>In the late stages, when the pulp is exposed, it may respond normally to a thermal stimulus, but generally it reacts feebly to heat and cold. The electric pulp test induces a response with a marked variation in current from the normal. Results of examination for mobility and percussion and palpation tests are negative. <br><br> <strong> Differential Diagnosis</strong> One must distinguish between reversible and irreversible pulpitis.<br><br> <strong> Clinical Note </strong>In reversible pulpitis, the pain produced by a thermal stimulus disappears as soon as the stimulus is removed, whereas in irreversible pulpitis, the pain lingers after the stimulus is removed, or it can occur spontaneously.<br><br> In the asymptomatic stage of irreversible pulpitis, the exposed pulp exhibits little or no pain, except when food is packed into the cavity. More current is required to elicit a response to the electric pulp test than in a control tooth.<br><br>In the early symptomatic stage, less current than what is normal is needed to elicit a response to the electric pulp tester, and the pulp is often abnormally responsive to a cold stimulus. The induced or spontaneous pain that occurs is sharp, piercing, and readily identified with a specific tooth. <br><br>Other symptoms may develop, such as diffuse, dull, constant pain, characterized by throbbing and gnawing, and the tooth may respond abnormally and severely to heat. This response is generally indicative of a later stage of irreversible pulpitis.<br><br>In this stage of irreversible pulpitis, the symptoms may simulate those of an acute alveolar abscess. Such an abscess, however, causes at least some of the following symptoms, which help to differentiate it from irreversible pulpitis: swelling, tenderness on palpation, tenderness on percussion, mobility of the tooth, and lack of response to pulp-vitality tests. In addition, the patient may have symptoms of systemic toxicity such as fever and nausea.<br><br>The pain of pulpitis is easy to localize by the patient at the onset. Once discomfort increases, the patient loses the ability to identify a particular tooth in the quadrant. A previous history of pain may help one to localize the origin of the pulpalgia. When pulpal pain is difficult to localize, the application of heat with a consequent abnormal response is indicative of irreversible pulpitis in that tooth.<br><br><strong>Treatment</strong>Treatment consists of complete removal of the pulp or pulpectomy. In posterior teeth, in which time is a factor, the removal of the coronal pulp or pulpotomy should be performed as an emergency procedure. Surgical removal should be considered if the tooth is not restorable. <br><br> <strong>Prognosis </strong> The prognosis of the tooth is favorable if the pulp is removed and if the tooth undergoes proper endodontic therapy and an appropriate post endodontic restoration. <br><br> The characteristic features distinguishing reversible and irreversible pulpitis are given in the table below: <br><br> <img class='image-center' src='./src/assets/Classification/Sub_Categories/Irreversible_Pulpitis_3.png' alt='Image-1'> <br><br> <strong> C. Chronic Hyperplastic Pulpitis </strong> <br> <strong><em>Definition: </em></strong> Chronic hyperplastic pulpitis, also known as pulpal hyperplasia or pulp polyp, is a productive pulpal inflammation due to an extensive carious exposure of a young pulp. This disorder is characterized by the development of granulation tissue, covered at times with epithelium and resulting from long-standing, low-grade irritation. <br><br> <strong>Cause</strong> Slow, progressive carious exposure of the pulp is the cause. For the development of hyperplastic pulpitis, a large, open cavity; a young, resistant pulp; and a chronic, low-grade stimulus are necessary. Mechanical irritation from chewing and bacterial infection often provide the stimulus.<br><br> <strong>Symptoms</strong>Chronic hyperplastic pulpitis is symptomless, except during mastication, when pressure of the food bolus may cause discomfort.<br><br> <strong>Diagnosis</strong>This disorder is generally seen only in the teeth of children and young adults. The appearance of the polypoid tissue is clinically characteristic; a fleshy, reddish pulpal mass fills most of the pulp chamber or cavity or even extends beyond the confines of the tooth. At times, the mass is large enough to interfere with comfortable closure of the teeth, although in the early stages of development, it may be the size of a pin. Polypoid tissue is less sensitive than normal pulp tissue and more sensitive than gingival tissue. Cutting of this tissue produces no pain, but pressure thereby transmitted to the apical end of the pulp does cause pain. This tissue bleeds easily because of a rich network of blood vessels.<br><br> <img class='image-center' src='./src/assets/Classification/Sub_Categories/Chronic_hyperplastic_pulpitis.png' alt='Image-1'> <br> If the hyperplastic pulp tissue extends beyond the cavity of a tooth, it may appear as if the gum tissue is growing into the cavity. To differentiate a pulp polyp from proliferating gingival tissue, one should raise and trace the stalk of the tissue back to its origin, the pulp chamber. <br><br>It should not be difficult to diagnose chronic hyperplastic pulpitis by clinical examination alone. The hyperplastic pulp tissue in the pulp chamber or cavity of a tooth is characteristic in appearance. <br><br>Radiographs generally show a large, open cavity with direct access to the pulp chamber. The tooth may respond feebly or not at all to the thermal test, unless one uses extreme cold, as from an ethyl chloride spray. More current than what is normal may be required to elicit a response by means of the electric pulp tester. <br><br> <strong>Differential Diagnosis</strong> The appearance of hyperplastic pulpitis is characteristic and should be easily recognized. The disorder must be distinguished from proliferating gingival tissue. <br><br> <strong> Treatment </strong> Treatment should be directed toward elimination of the polypoid tissue followed by extirpation of the pulp, provided the tooth can be restored. When the hyperplastic pulpal mass has been removed with a periodontal curette or spoon excavator, the bleeding can be controlled with pressure. The pulp tissue of the chamber is then completely removed, and a temporary dressing is sealed in contact with the radicular pulp tissue. The radicular pulp is extirpated at a later visit. If time permits, the entire procedure, pulpectomy, can be completed in a single visit. <br><br> <strong> Prognosis </strong>The prognosis for the pulp is unfavorable. The prognosis for the tooth is favorable after endodontic treatment and adequate restoration. <br><br> <strong> D. Internal Resorption </strong> <br> <strong> Definition:</strong> Resorption is defined as a condition associated with either a physiologic or a pathologic process resulting in loss of dentin, cementum, or bone. Internal resorption is an idiopathic slow or fast progressive resorptive process occurring in the dentin of the pulp chamber or in the root canals of the teeth. <br><br> <strong> Cause </strong>The cause of internal resorption is not known, but such patients often have a history of trauma.<br><br> <strong>Symptoms</strong>Internal resorption in the root of a tooth is asymptomatic. In the crown of the tooth, internal resorption may be manifested as a reddish area called pink spot. This reddish area represents the granulation tissue showing through the resorbed area of the crown.<br><br> <strong>Diagnosis</strong>Internal resorption may affect either the crown or the root of the tooth, or it may be extensive enough to involve both. <br><br> <img class='image-center' src='./src/assets/Classification/Sub_Categories/Internal_Resorption.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Classification/Sub_Categories/Internal_Resorption_2.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Classification/Sub_Categories/Internal_Resorption_3.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Classification/Sub_Categories/Internal_Resorption_4.png' alt='Image-1'> <br> It may be a slow, progressive, intermittent process extending over 1 or 2 years; it may develop rapidly and may perforate the tooth within a matter of months. Although any tooth in the mouth can be involved, those most readily recognized are the maxillary anterior teeth. Usually, internal resorption is diagnosed during routine radiographic examination. <br><br> The appearance of the “pink spot” occurs late in the resorptive process, when the integrity of the crown has been compromised. The radiograph usually shows a change in the appearance of the wall in the root canal or pulp chamber, with a round or ovoid radiolucent area. <br><br> <strong>Differential Diagnosis</strong>When internal resorption progresses into the periodontal space, a perforation of the root occurs; it is difficult to differentiate from external resorption; in internal resorption, the resorptive defect is more extensive in the pulpal wall than on the root surface. This defect usually is recognized by means of a radiograph. <br><br><strong>Treatment</strong> Extirpation of the pulp stops the internal resorptive process. Routine endodontic treatment is indicated, but obturation of the defect requires a special effort, preferably with a plasticized gutta-percha method. In many patients, however, the condition progresses unobserved because it is painless, until the root is perforated. In such a case, mineral trioxide aggregate (MTA) is recommended to repair the defect. When repair has been completed, the canal with its defect is obturated with plasticized gutta-percha. <br><br><strong>Prognosis</strong>The prognosis is best before perforation of the root or crown occurs. In the event of a root-crown perforation, the prognosis is guarded and depends on the access to the perforation that permits surgical repair. <br><br> <strong>Citations</strong> <br> <strong><em> Irreversible Pulpitis </em></strong> Dabuleanu M. Pulpitis (reversible/irreversible). J Can Dent Assoc. 2013;79:d90. PMID: 24059490. <br> <a target='_blank' href='https://jcda.ca/article/d90'>https://jcda.ca/article/d90</a> <br> <strong><em> Chronic Hyperplastic Pulpitis </em></strong> Suresh, Kandagal V; Bajaj, Nidhi; Nayak, Ajay G; Chapi D, Mounesh Kumar1; Patil, Snehal2; Rani, Ashwini. Pulp polyp - A periapical lesion: Radiographic observational study. Journal of Indian Academy of Oral Medicine and Radiology 27(1):p 68-71, Jan-Mar 2015. <br> <a target='_blank' href='https://www.researchgate.net/publication/282912632_Pulp_polyp_-_A_periapical_lesion_Radiographic_observational_study'>https://www.researchgate.net/publication/282912632_Pulp_polyp_-_A_periapical_lesion_Radiographic_observational_study</a> <br> <strong><em> Internal Resorption </em></strong>1. Patel S, Ricucci D, Durak C, Tay F. Internal root resorption: a review. J Endod. 2010 Jul;36(7):1107-21. <br> <a target='_blank' href='https://www.academia.edu/4256195/2010_Patel_Internal_Root_Resorption_A_Review'>https://www.academia.edu/4256195/2010_Patel_Internal_Root_Resorption_A_Review</a> <br> 2. Aidos H, Diogo P, Santos JM. Root Resorption Classifications: A Narrative Review and a Clinical Aid Proposal for Routine Assessment. Eur Endod J. 2018 Nov 21;3(3):134-145. <br> <a target='_blank' href='https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7006572/'>https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7006572/</a>"
                }
            },
            "Calcific Degeneration": {
                "card_content": {
                    "img": "./src/assets/Classification/Sub_Categories/Banner/Calcific_Degeneration.png",
                    "title": "Pulp Degeneration: Calcific Degeneration",
                    "content": "In calcific degeneration, part of the pulp tissue is replaced by calcific material, i.e., pulp stones or denticles. Calcification may occur either within the pulp chamber or within the root canal, but it is generally present in the pulp chamber. <br><br> <img class='image-center' src='./src/assets/Classification/Sub_Categories/Calcific_Degeneration_1.jpg' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Classification/Sub_Categories/Calcific_Degeneration_2.png' alt='Image-1'> <br> <img class='image-center' src='./src/assets/Classification/Sub_Categories/Calcific_Degeneration_3.jpg' alt='Image-1'> <br> The calcified material has a laminated structure, like the skin of an onion, and lies unattached within the body of the pulp. A denticle or pulp stone may become large enough to give an impression of the pulp cavity when the calcified mass is removed. In another type of calcification, the calcified material is attached to the wall of the pulp cavity and is an integral part of it. It is not always possible to distinguish one type from another on a radiograph. It is estimated that pulp stones are present in more than 60% of adult teeth. They are considered to be harmless concretions, although referred pain in a few patients has been ascribed to the presence of these calcifications in the pulp.<br><br> The calcific degeneration of the complete pulp space when it occurs as a sequela to a traumatic injury is known as calcific metamorphosis. This is a type of a pulpal response to trauma characterized by rapid deposition of hard tissue within the canal space. Such teeth usually remain clinically asymptomatic and may exhibit discoloration of the clinical crown. Obliteration of the pulp space is evident radiographically as an intracanal radio-opacity similar to the surrounding dentin. <br><br> <img class='image-center' src='./src/assets/Classification/Sub_Categories/Calcific_Degeneration_4.png' alt='Image-1'> <br> <strong>Clinical Note</strong>Clinical management of a case of calcific metamorphosis is given below:<br><br>• Asymptomatic tooth<br><br>-- Esthetic management of the discolored tooth with a full-coverage restoration or laminate restoration. <br><br>• Symptomatic tooth <br><br>-- Endodontic therapy using a microsurgical retrograde approach is recommended.<br><br> -- Endodontic therapy is not recommended unless the tooth is symptomatic. <br><br> <strong>Citations</strong>1. Goga, R., Chandler, N. P., & Oginni, A. O. (2008). Pulp stones: a review. International Endodontic Journal, 41(6), 457-468. <br> <a target='_blank' href='https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1365-2591.2008.01374.x'>https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1365-2591.2008.01374.x</a> <br> 2. Siddiqui SH, Mohamed AN. Calcific Metamorphosis: A Review. Int J Health Sci (Qassim). 2016 Jul;10(3):437-42. <br> <a target='_blank' href='https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5003587/'>https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5003587/</a>"
                }
            },
            "Fibrous Degeneration": {
                "card_content": {
                    "img": "./src/assets/Classification/Sub_Categories/Banner/Fibrous_Degeneration.png",
                    "title": "Pulp Degeneration: Fibrous Degeneration",
                    "content": "This form of degeneration of the pulp is characterized by replacement of the cellular elements by fibrous connective tissue. On removal from the root canal, such a pulp has the characteristic appearance of a leathery fiber. This disorder causes no distinguishing symptoms to aid in the clinical diagnosis.<br><br> <img class='image-center' src='./src/assets/Classification/Sub_Categories/Fibrous_Degeneration_1.png' alt='Image-1'> <br><img class='image-center' src='./src/assets/Classification/Sub_Categories/Fibrous_Degeneration_2.png' alt='Image-1'> <br><img class='image-center' src='./src/assets/Classification/Sub_Categories/Fibrous_Degeneration_3.png' alt='Image-1'> <br>"
                }
            }
        }
    }
}